<?php
return array(

    "ssc_bonus" => array(

        30 => array(

            '五星直选复式' => 130000,
            '五星直选单式' => 130000,
            '前四直选复式' => 13000,
            '后四直选复式' => 13000,
            '前四直选单式' => 13000,
            '后四直选单式' => 13000,
            '前三直选复式' => 1300,
            '后三直选复式' => 1300,
            '前三直选单式' => 1300,
            '后三直选单式' => 1300,
            '前三直选和值' => 1300,
            '后三直选和值' => 1300,
            '前三组六' => 220,
            '前三组六胆拖' => 220,
            '后三组六' => 220,
            '前三组三胆拖' => 220,
            '前三组三' => 430,
            '后三组三' => 430,
            '前三混合组选' => array('组三' => 430, '组六' => 220),
            '后三混合组选' => array('组三' => 430, '组六' => 220),
            '前三组选和值' => array('组三' => 430, '组六' => 220),
            '后三组选和值' => array('组三' => 430, '组六' => 220),
            '前二直选复式' => 130,
            '后二直选复式' => 130,
            '前二直选单式' => 130,
            '后二直选单式' => 130,
            '前二直选和值' => 130,
            '后二直选和值' => 130,
            '前二组选复式' => 65,
            '前二组选胆拖' => 65,
            '后二组选复式' => 65,
            '后二组选胆拖' => 65,
            '前二组选单式' => 65,
            '后二组选单式' => 65,
            '前二组选和值' => 65,
            '后二组选和值' => 65,
            '前二大小单双' => 5.2,
            '后二大小单双' => 5.2,
            '前三大小单双' => 10.4,
            '后三大小单双' => 10.4,
            '定位胆' => 13


        ),

        50 => array(

            '五星直选复式' => 150000,
            '五星直选单式' => 150000,
            '前四直选复式' => 15000,
            '后四直选复式' => 15000,
            '前四直选单式' => 15000,
            '后四直选单式' => 15000,
            '前三直选复式' => 1500,
            '后三直选复式' => 1500,
            '前三直选单式' => 1500,
            '后三直选单式' => 1500,
            '前三直选和值' => 1500,
            '后三直选和值' => 1500,
            '前三组六' => 250,
            '前三组六胆拖' => 250,
            '后三组六' => 250,
            '后三组六胆拖' => 250,
            '前三组三' => 500,
            '后三组三' => 500,
            '前三混合组选' => array('组三' => 500, '组六' => 250),
            '后三混合组选' => array('组三' => 500, '组六' => 250),
            '前三组选和值' => array('组三' => 500, '组六' => 250),
            '后三组选和值' => array('组三' => 500, '组六' => 250),
            '前二直选复式' => 150,
            '后二直选复式' => 150,
            '前二直选单式' => 150,
            '后二直选单式' => 150,
            '前二直选和值' => 150,
            '后二直选和值' => 150,
            '前二组选复式' => 75,
            '前二组选胆拖' => 75,
            '后二组选复式' => 75,
            '后二组选胆拖' => 75,
            '前二组选单式' => 75,
            '后二组选单式' => 75,
            '前二组选和值' => 75,
            '后二组选和值' => 75,
            '前二大小单双' => 6,
            '后二大小单双' => 6,
            '前三大小单双' => 12,
            '后三大小单双' => 12,
            '定位胆' => 15


        ),

        70 => array(

            '五星直选复式' => 170000,
            '五星直选单式' => 170000,
            '前四直选复式' => 17000,
            '后四直选复式' => 17000,
            '前四直选单式' => 17000,
            '后四直选单式' => 17000,
            '前三直选复式' => 1700,
            '中三直选复式' => 1700,
            '后三直选复式' => 1700,
            '前三直选单式' => 1700,
            '中三直选单式' => 1700,
            '后三直选单式' => 1700,
            '前三直选和值' => 1700,
            '中三直选和值' => 1700,
            '后三直选和值' => 1700,
            '前三组六' => 283.33,
            '中三组六' => 283.33,
            '前三组六胆拖' => 283.33,
            '中三组六胆拖' => 283.33,
            '后三组六' => 283.33,
            '后三组六胆拖' => 283.33,
            '前三组三' => 566.67,
            '中三组三' => 566.67,
            '后三组三' => 566.67,
            '前三混合组选' => array('组三' => 566.67, '组六' => 283.33),
            '中三混合组选' => array('组三' => 566.67, '组六' => 283.33),
            '后三混合组选' => array('组三' => 566.67, '组六' => 283.33),
            '前三组选和值' => array('组三' => 566.67, '组六' => 283.33),
            '后三组选和值' => array('组三' => 566.67, '组六' => 283.33),
            '前二直选复式' => 170,
            '后二直选复式' => 170,
            '前二直选单式' => 170,
            '后二直选单式' => 170,
            '前二直选和值' => 170,
            '后二直选和值' => 170,
            '前二组选复式' => 85,
            '前二组选胆拖' => 85,
            '后二组选复式' => 85,
            '后二组选胆拖' => 85,
            '前二组选单式' => 85,
            '后二组选单式' => 85,
            '前二组选和值' => 85,
            '后二组选和值' => 85,
            '前二大小单双' => 6.8,
            '后二大小单双' => 6.8,
            '前三大小单双' => 13.6,
            '后三大小单双' => 13.6,
            '定位胆' => 17,
            '组选120' => 1416.67,
            '组选60' => 2833.33,
            '组选30' => 5666.67,
            '组选20' => 8500,
            '组选10' => 17000,
            '组选5' => 34000,
            '组选24' => 708.33,
            '组选12' => 1416.67,
            '组选6' => 2833.33,
            '组选4' => 4250,
            '一帆风顺' => 4.06,
            '好事成双' => 20.77,
            '三星报喜' => 198.32,
            '四季发财' => 3682.61,
            '任二直选复式' => 170,
            '任二直选单式' => 170,
            '任二直选和值' => 170,
            '任二组选复式' => 85,
            '任二组选单式' => 85,
            '任二组选和值' => 85,
            '任三直选复式' => 1700,
            '任三直选单式' => 1700,
            '任三直选和值' => 1700,
            '组三复式' => 566.67,
            '组三单式' => 566.67,
            '组六复式' => 283.33,
            '组六单式' => 283.33,
            '任三混合组选' => array('组三' => 566.67, '组六' => 283.33),
            '任三组选和值' => array('组三' => 566.67, '组六' => 283.33),
            '任四直选复式' => 17000,
            '任四直选单式' => 17000,
            '任四组选24' => 700,
            '任四组选12' => 1400,
            '任四组选6' => 2800,
            '任四组选4' => 4200,
            "龙虎和万千" => 3.828,
            "龙虎和万百" => 3.828,
            "龙虎和万十" => 3.828,
            "龙虎和万个" => 3.828,
            "龙虎和千百" => 3.828,
            "龙虎和千十" => 3.828,
            "龙虎和千个" => 3.828,
            "龙虎和百十" => 3.828,
            "龙虎和百个" => 3.828,
            "龙虎和十个" => 3.828,
            "龙虎和"    =>17.00,
            "五星和大" => 3.4,
            "五星和小" => 3.4,
            "五星和单" => 3.4,
            "五星和双" => 3.4,
            "有牛"    =>26.06,
            "没牛"    => 4.76,
            "牛大小单双" =>  5.2
        ),


        80 => array(

            '五星直选复式' => 180000,
            '五星直选单式' => 180000,
            '前四直选复式' => 18000,
            '后四直选复式' => 18000,
            '前四直选单式' => 18000,
            '后四直选单式' => 18000,
            '前三直选复式' => 1800,
            '后三直选复式' => 1800,
            '前三直选单式' => 1800,
            '后三直选单式' => 1800,
            '前三直选和值' => 1800,
            '后三直选和值' => 1800,
            '前三组六' => 300,
            '前三组六胆拖' => 300,
            '后三组六' => 300,
            '后三组六胆拖' => 300,
            '前三组三' => 600,
            '后三组三' => 600,
            '前三混合组选' => array('组三' => 600, '组六' => 300),
            '后三混合组选' => array('组三' => 600, '组六' => 300),
            '前三组选和值' => array('组三' => 600, '组六' => 300),
            '后三组选和值' => array('组三' => 600, '组六' => 300),
            '前二直选复式' => 180,
            '后二直选复式' => 180,
            '前二直选单式' => 180,
            '后二直选单式' => 180,
            '前二直选和值' => 180,
            '后二直选和值' => 180,
            '前二组选复式' => 90,
            '前二组选胆拖' => 90,
            '后二组选复式' => 90,
            '后二组选胆拖' => 90,
            '前二组选单式' => 90,
            '后二组选单式' => 90,
            '前二组选和值' => 90,
            '后二组选和值' => 90,
            '前二大小单双' => 7.2,
            '后二大小单双' => 7.2,
            '前三大小单双' => 14.4,
            '后三大小单双' => 14.4,
            '定位胆' => 18


        ),

        90 => array(

            '五星直选复式' => 190000,
            '五星直选单式' => 190000,
            '前四直选复式' => 19000,
            '后四直选复式' => 19000,
            '前四直选单式' => 19000,
            '后四直选单式' => 19000,
            '前三直选复式' => 1900,
            '后三直选复式' => 1900,
            '前三直选单式' => 1900,
            '后三直选单式' => 1900,
            '前三直选和值' => 1900,
            '后三直选和值' => 1900,
            '前三组六' => 315,
            '前三组六胆拖' => 315,
            '后三组六' => 315,
            '后三组六胆拖' => 315,
            '前三组三' => 625,
            '后三组三' => 625,
            '前三混合组选' => array('组三' => 625, '组六' => 315),
            '后三混合组选' => array('组三' => 625, '组六' => 315),
            '前三组选和值' => array('组三' => 625, '组六' => 315),
            '后三组选和值' => array('组三' => 625, '组六' => 315),
            '前二直选复式' => 190,
            '后二直选复式' => 190,
            '前二直选单式' => 190,
            '后二直选单式' => 190,
            '前二直选和值' => 190,
            '后二直选和值' => 190,
            '前二组选复式' => 95,
            '前二组选胆拖' => 95,
            '后二组选复式' => 95,
            '后二组选胆拖' => 95,
            '前二组选单式' => 95,
            '后二组选单式' => 95,
            '前二组选和值' => 95,
            '后二组选和值' => 95,
            '前二大小单双' => 7.6,
            '后二大小单双' => 7.6,
            '前三大小单双' => 15.2,
            '后三大小单双' => 15.2,
            '定位胆' => 19


        ),


    ),

    "ssc_bonus_bdw" => array(

        1 => array(
            '前三一码不定位' => 6.6,
            '后三一码不定位' => 6.6,
            '后四一码不定位' => 4.77,
            '前四一码不定位' => 4.77,
            '前三二码不定位' => 30.23,
            '后三二码不定位' => 30.23,
            '后四二码不定位' => 16.86,
            '前四二码不定位' => 16.86,
            '五星二码不定位' => 10.98,
            '五星三码不定位' => 37.56,
            '五星一码不定位' => 3.8

        ),
        2 => array(
            '前三一码不定位' => 6.6,
            '后三一码不定位' => 6.6,
            '后四一码不定位' => 4.77,
            '前四一码不定位' => 4.77,
            '前三二码不定位' => 30.23,
            '后三二码不定位' => 30.23,
            '后四二码不定位' => 16.86,
            '前四二码不定位' => 16.86,
            '五星二码不定位' => 10.98,
            '五星三码不定位' => 37.56,
            '五星一码不定位' => 3.8

        )

    ),

    "xw_bonus" => array(

        50 => array(

            '前三直选复式' => 1485,
            '后三直选复式' => 1485,
            '前三直选单式' => 1485,
            '后三直选单式' => 1485,

            '前三组选复式' => 247.5,
            '前三组选胆拖' => 247.5,
            '前三组选单式' => 247.5,
            '后三组选复式' => 247.5,
            '后三组选胆拖' => 247.5,
            '后三组选单式' => 247.5,
            '前二直选复式' => 165,
            '后二直选复式' => 165,
            '前二直选单式' => 165,
            '后二直选单式' => 165,

            '前二组选复式' => 82.5,
            '前二组选胆拖' => 82.5,
            '后二组选复式' => 82.5,
            '后二组选胆拖' => 82.5,
            '前二组选单式' => 82.5,
            '后二组选单式' => 82.5,

            '定单双' => array(692.5, 23, 4.5, 3.5, 9.1, 115),
            '猜中位' => array(24.7, 11, 7.6, 6.9),
            '定位胆' => 16.5,

            '任选一' => 3.2,
            '任选二' => 8.3,
            '任选三' => 24.7,
            '任选四' => 98,
            '任选五' => 692.5,
            '任选六' => 115,
            '任选七' => 33,
            '任选八' => 13,

            '任选一单式' => 3.2,
            '任选二单式' => 8.3,
            '任选三单式' => 24.7,
            '任选四单式' => 98,
            '任选五单式' => 692.5,
            '任选六单式' => 115,
            '任选七单式' => 33,
            '任选八单式' => 13,

            '任选二胆拖' => 8.3,
            '任选三胆拖' => 24.7,
            '任选四胆拖' => 98,
            '任选五胆拖' => 692.5,
            '任选六胆拖' => 115,
            '任选七胆拖' => 33,
            '任选八胆拖' => 13

        ),


        70 => array(

            '前三直选复式' => 1653.3,
            '后三直选复式' => 1653.3,
            '前三直选单式' => 1653.3,
            '后三直选单式' => 1653.3,

            '前三组选复式' => 275.55,
            '前三组选胆拖' => 275.55,
            '前三组选单式' => 275.55,
            '后三组选复式' => 275.55,
            '后三组选胆拖' => 275.55,
            '后三组选单式' => 297,
            '后三组选复式' => 275.55,
            '前二直选复式' => 183.7,
            '后二直选复式' => 183.7,
            '前二直选单式' => 183.7,
            '后二直选单式' => 183.7,

            '前二组选复式' => 91.85,
            '前二组选胆拖' => 91.85,
            '后二组选复式' => 91.85,
            '后二组选胆拖' => 91.85,
            '前二组选单式' => 91.85,
            '后二组选单式' => 91.85,

            '定单双' => array(776, 25, 5.1, 3.7, 10, 129),
            '猜中位' => array(28, 12.5, 8.6, 7.8),
            '定位胆' => 18.37,

            '任选一' => 3.61,
            '任选二' => 9.18,
            '任选三' => 27.55,
            '任选四' => 109.42,
            '任选五' => 770.94,
            '任选六' => 127.99,
            '任选七' => 36.74,
            '任选八' => 13.72,
            '任选一单式' => 3.61,
            '任选二单式' => 9.18,
            '任选三单式' => 27.55,
            '任选四单式' => 109.42,
            '任选五单式' => 770.94,
            '任选六单式' => 127.99,
            '任选七单式' => 36.74,
            '任选八单式' => 13.72,
            '任选二胆拖' => 9.18,
            '任选三胆拖' => 27.55,
            '任选四胆拖' => 109.42,
            '任选五胆拖' => 770.94,
            '任选六胆拖' => 127.99,
            '任选七胆拖' => 36.74,
            '任选八胆拖' => 13.72
        ),

        80 => array(

            '前三直选复式' => 1782,
            '后三直选复式' => 1782,
            '前三直选单式' => 1782,
            '后三直选单式' => 1782,

            '前三组选复式' => 297,
            '前三组选胆拖' => 297,
            '前三组选单式' => 297,
            '后三组选复式' => 297,
            '后三组选胆拖' => 297,
            '后三组选单式' => 297,
            '前二直选复式' => 198,
            '后二直选复式' => 198,
            '前二直选单式' => 198,
            '后二直选单式' => 198,

            '前二组选复式' => 99,
            '前二组选胆拖' => 99,
            '后二组选复式' => 99,
            '后二组选胆拖' => 99,
            '前二组选单式' => 99,
            '后二组选单式' => 99,

            '定位胆' => 19.8,
            '定单双' => array(831, 27.7, 5.5, 4.1, 11, 138),
            '猜中位' => array(29.7, 13.2, 9.2, 8.3),
            '任选一' => 3.9,
            '任选二' => 9.9,
            '任选三' => 29.7,
            '任选四' => 118,
            '任选五' => 831,
            '任选六' => 138,
            '任选七' => 39.6,
            '任选八' => 14.8,
            '任选一单式' => 3.2,
            '任选二单式' => 8.3,
            '任选三单式' => 24.7,
            '任选四单式' => 98,
            '任选五单式' => 692.5,
            '任选六单式' => 115,
            '任选七单式' => 33,
            '任选八单式' => 13,

            '任选二胆拖' => 8.3,
            '任选三胆拖' => 24.7,
            '任选四胆拖' => 98,
            '任选五胆拖' => 692.5,
            '任选六胆拖' => 115,
            '任选七胆拖' => 33,
            '任选八胆拖' => 13

        ),
        90 => array(

            '前三直选复式' => 1870,
            '后三直选复式' => 1870,
            '前三直选单式' => 1870,
            '后三直选单式' => 1870,

            '前三组选复式' => 310,
            '前三组选胆拖' => 310,
            '前三组选单式' => 310,
            '后三组选复式' => 310,
            '后三组选胆拖' => 310,
            '后三组选单式' => 310,
            '前二直选复式' => 206,
            '后二直选复式' => 206,
            '前二直选单式' => 206,
            '后二直选单式' => 206,

            '前二组选复式' => 103,
            '前二组选胆拖' => 103,
            '后二组选复式' => 103,
            '后二组选胆拖' => 103,
            '前二组选单式' => 103,
            '后二组选单式' => 103,

            '定位胆' => 20.6,
            '定单双' => array(865, 28.5, 5.8, 4.3, 11.5, 144),
            '猜中位' => array(31, 13.8, 9.6, 8.6),
            '任选一' => 4,
            '任选二' => 10.2,
            '任选三' => 31,
            '任选四' => 122,
            '任选五' => 865,
            '任选六' => 144,
            '任选七' => 40.5,
            '任选八' => 15.5,
            '任选一单式' => 3.2,
            '任选二单式' => 8.3,
            '任选三单式' => 24.7,
            '任选四单式' => 98,
            '任选五单式' => 692.5,
            '任选六单式' => 115,
            '任选七单式' => 33,
            '任选八单式' => 13,
            '任选二胆拖' => 8.3,
            '任选三胆拖' => 24.7,
            '任选四胆拖' => 98,
            '任选五胆拖' => 692.5,
            '任选六胆拖' => 115,
            '任选七胆拖' => 33,
            '任选八胆拖' => 13

        ),

    ),

    "xw_bonus_bdw" => array(
        1 => array(
            '前三一码不定位' => 7.22,
            '后三一码不定位' => 7.22
        ),
        2 => array(
            '前三一码不定位' => 7.22,
            '后三一码不定位' => 7.22
        )

    ),

    "psds_bonus" => array(

        30 => array(
            '直选复式' => 1300,
            '直选单式' => 1300,
            '直选和值' => 1300,
            '前二直选和值' => 1300,
            '后二直选和值' => 1300,
            '组六' => 220,
            '组三' => 430,
            '混合组选' => array('组三' => 430, '组六' => 220),
            '组选和值' => array('组三' => 430, '组六' => 220),
            '前二直选复式' => 130,
            '后二直选复式' => 130,
            '前二直选单式' => 130,
            '后二直选单式' => 130,
            '前二组选复式' => 65,
            '后二组选复式' => 65,
            '前二组选单式' => 65,
            '后二组选单式' => 65,
            '前二大小单双' => 5.2,
            '后二大小单双' => 5.2,
            '三码大小单双' => 10.4,
            '定位胆' => 13,
            '前二组选和值' => 65,
            '后二组选和值' => 65
        ),

        50 => array(
            '直选复式' => 1500,
            '直选单式' => 1500,
            '直选和值' => 1500,
            '前二直选和值' => 1500,
            '后二直选和值' => 1500,
            '组六' => 250,
            '组三' => 500,
            '混合组选' => array('组三' => 500, '组六' => 250),
            '组选和值' => array('组三' => 500, '组六' => 250),
            '前二直选复式' => 150,
            '后二直选复式' => 150,
            '前二直选单式' => 150,
            '后二直选单式' => 150,
            '前二组选复式' => 75,
            '后二组选复式' => 75,
            '前二组选单式' => 75,
            '后二组选单式' => 75,
            '前二大小单双' => 6,
            '后二大小单双' => 6,
            '三码大小单双' => 12,
            '定位胆' => 15,
            '前二组选和值' => 65,
            '后二组选和值' => 65

        ),

        70 => array(
            '直选复式' => 1710,
            '直选单式' => 1710,
            '直选和值' => 1710,
            '前二直选和值' => 171,
            '后二直选和值' => 171,
            '组六' => 285,
            '组三' => 570,
            '前三组三' => 570,
            '前三组六' => 285,
            '混合组选' => array('组三' => 570, '组六' => 285),
            '组选和值' => array('组三' => 570, '组六' => 285),
            '前二直选复式' => 171,
            '后二直选复式' => 171,
            '前二直选单式' => 171,
            '后二直选单式' => 171,

            '前二组选复式' => 85.5,
            '后二组选复式' => 85.5,
            '前二组选单式' => 85.5,
            '后二组选单式' => 85.5,
            '前二大小单双' => 6.84,
            '后二大小单双' => 6.84,
            '三码大小单双' => 13.6,
            '定位胆' => 17.1,
            '前二组选和值' => 85.5,
            '后二组选和值' => 85.5

        ),

        80 => array(
            '直选复式' => 1800,
            '直选单式' => 1800,
            '直选和值' => 1800,
            '前二直选和值' => 1800,
            '后二直选和值' => 1800,
            '组六' => 300,
            '组三' => 600,
            '混合组选' => array('组三' => 600, '组六' => 300),
            '组选和值' => array('组三' => 600, '组六' => 300),
            '前二直选复式' => 180,
            '后二直选复式' => 180,
            '前二直选单式' => 180,
            '后二直选单式' => 180,

            '前二组选复式' => 90,
            '后二组选复式' => 90,
            '前二组选单式' => 90,
            '后二组选单式' => 90,
            '前二大小单双' => 7.2,
            '后二大小单双' => 7.2,
            '三码大小单双' => 14.4,
            '定位胆' => 18,
            '前二组选和值' => 65,
            '后二组选和值' => 65

        ),
        90 => array(
            '直选复式' => 1900,
            '直选单式' => 1900,
            '直选和值' => 1900,
            '前二直选和值' => 1900,
            '后二直选和值' => 1900,
            '组六' => 315,
            '组三' => 625,
            '混合组选' => array('组三' => 625, '组六' => 315),
            '组选和值' => array('组三' => 625, '组六' => 315),
            '前二直选复式' => 190,
            '后二直选复式' => 190,
            '前二直选单式' => 190,
            '后二直选单式' => 190,

            '前二组选复式' => 95,
            '后二组选复式' => 95,
            '前二组选单式' => 95,
            '后二组选单式' => 95,
            '前二大小单双' => 7.6,
            '后二大小单双' => 7.6,
            '三码大小单双' => 15.2,
            '定位胆' => 19,
            '前二组选和值' => 65,
            '后二组选和值' => 65

        )

    ),

    "psds_bonus_bdw" => array(
        1 => array('一码不定位' => 5.24, '二码不定位' => 31.64),
        2 => array('一码不定位' => 5.24, '二码不定位' => 31.64)
    ),

    "shf_bonus" => array(
        50 => array(
            '前三直选复式' => 10250,
            '后三直选复式' => 10250,
            '前三组选复式' => 1710,
            '后三组选复式' => 1710,

            '二连直' => 81,
            '二连组' => 40.5,

            '任选一' => 4,
            '任选二' => 9.7,
            '任选三' => 30,
            '任选四' => 103,
            '任选五' => 415.5,
            '任选一胆拖' => 4,
            '任选二胆拖' => 9.7,
            '任选三胆拖' => 30,
            '任选四胆拖' => 103,
            '任选五胆拖' => 415.5
        ),

        70 => array(
            '前三直选复式' => 11491,
            '后三直选复式' => 11491,
            '前三组选复式' => 1915,
            '后三组选复式' => 1915,

            '二连直' => 80,
            '二连组' => 40,

            '任选一' => 4,
            '任选二' => 11,
            '任选三' => 34,
            '任选四' => 116,
            '任选五' => 465,
            '任选一胆拖' => 4,
            '任选二胆拖' => 11,
            '任选三胆拖' => 34,
            '任选四胆拖' => 116,
            '任选五胆拖' => 465,
            '定位胆' => 33
        ),
        80 => array(
            '前三直选复式' => 12300,
            '后三直选复式' => 12300,
            '前三组选复式' => 2050,
            '后三组选复式' => 2050,

            '二连直' => 97,
            '二连组' => 48.5,

            '任选一' => 4.4,
            '任选二' => 11.7,
            '任选三' => 36,
            '任选四' => 124,
            '任选五' => 498,
            '任选一胆拖' => 4.4,
            '任选二胆拖' => 11.7,
            '任选三胆拖' => 36,
            '任选四胆拖' => 124,
            '任选五胆拖' => 498,
            '定位胆' => 36
        ),
        90 => array(
            '前三直选复式' => 12995,
            '后三直选复式' => 12995,
            '前三组选复式' => 2166,
            '后三组选复式' => 2166,

            '二连直' => 102.5,
            '二连组' => 51,

            '任选一' => 4.6,
            '任选二' => 12.3,
            '任选三' => 38,
            '任选四' => 131,
            '任选五' => 526,
            '任选一胆拖' => 4.6,
            '任选二胆拖' => 12.3,
            '任选三胆拖' => 38,
            '任选四胆拖' => 131,
            '任选五胆拖' => 526,
            '定位胆' => 38
        )

    ),

    "shs_bonus" => array(

        50 => array(

            '蓝球任选一' => 23,
            '红球任选一' => 7,
            '红球任选二' => 50,
            '红球任选三' => 400,
            '红球任选四' => 3900,
            '红球任选五' => 58000,
            '选十中六' => 7500,
            '选十五中六' => 320,
            '选十八中六' => 84,
            '选二十中六' => 41,
            '选二十五中六' => 8.5


        ),

        70 => array(

            '蓝球任选一' => 16,
            '红球任选一' => 8,
            '红球任选二' => 56,
            '红球任选三' => 440,
            '红球任选四' => 4400,
            '红球任选五' => 62000,
            '选十中六' => 8700,
            '选十五中六' => 340,
            '选十八中六' => 94,
            '选二十中六' => 42,
            '选二十五中六' => 9.5


        ),


        80 => array(

            '蓝球任选一' => 28,
            '红球任选一' => 9,
            '红球任选二' => 60,
            '红球任选三' => 470,
            '红球任选四' => 4700,
            '红球任选五' => 67000,
            '选十中六' => 9000,
            '选十五中六' => 380,
            '选十八中六' => 100,
            '选二十中六' => 48,
            '选二十五中六' => 10


        ),

        90 => array(

            '蓝球任选一' => 29,
            '红球任选一' => 10,
            '红球任选二' => 65,
            '红球任选三' => 500,
            '红球任选四' => 4000,
            '红球任选五' => 70000,
            '选十中六' => 9700,
            '选十五中六' => 400,
            '选十八中六' => 106,
            '选二十中六' => 50,
            '选二十五中六' => 11


        ),

    ),

    "qxc_bonus" => array(
        50 => array(
            '前五星直选复式' => 150000,
            '前五星直选单式' => 150000,

            '前四星直选复式' => 15000,
            '后四星直选复式' => 15000,
            '前四星直选单式' => 15000,
            '后四星直选单式' => 15000,
            '前三星直选复式' => 1500,
            '后三星直选复式' => 1500,
            '前三星直选单式' => 1500,
            '后三星直选单式' => 1500,
            '前三直选和值' => 1500,
            '后三直选和值' => 1500,
            '前三组六' => 250,
            '后三组六' => 250,
            '前三组三' => 500,
            '后三组三' => 500,
            '前三混合组选' => array('组六' => 250, '组三' => 500),
            '后三混合组选' => array('组六' => 250, '组三' => 500),
            '前三组选和值 ' => array('组六' => 250, '组三' => 500),
            '后三组选和值 ' => array('组六' => 250, '组三' => 500),
            '前二直选复式' => 150,
            '后二直选复式' => 150,
            '前二直选单式' => 150,
            '后二直选单式' => 150,
            '前二直选和值' => 150,
            '后二直选和值' => 150,
            '前二组选复式' => 75,
            '后二组选复式' => 75,
            '前二组选单式' => 75,
            '后二组选单式' => 75,
            '前二组选和值' => 75,
            '后二组选和值' => 75,
            '前二大小单双' => 6,
            '后二大小单双' => 6,
            '前三大小单双' => 12,
            '后三大小单双' => 12,
            '定位胆' => 15
        ),
        70 => array(

            '前五星直选复式' => 170000,
            '前五星直选单式' => 170000,
            '前四直选复式' => 17000,
            '后四直选复式' => 17000,
            '前四直选单式' => 17000,
            '后四直选单式' => 17000,
            '前三直选复式' => 1700,
            '后三直选复式' => 1700,
            '前三直选单式' => 1700,
            '后三直选单式' => 1700,
            '前三直选和值' => 1700,
            '后三直选和值' => 1700,
            '前三组六' => 280,
            '后三组六' => 280,
            '前三组三' => 570,
            '后三组三' => 570,
            '前三混合组选' => array('组三' => 570, '组六' => 280),
            '后三混合组选' => array('组三' => 570, '组六' => 280),
            '前三组选和值' => array('组三' => 570, '组六' => 280),
            '后三组选和值' => array('组三' => 570, '组六' => 280),
            '前二直选复式' => 170,
            '后二直选复式' => 170,
            '前二直选单式' => 170,
            '后二直选单式' => 170,
            '前二直选和值' => 170,
            '后二直选和值' => 170,
            '前二组选复式' => 85,
            '后二组选复式' => 85,
            '前二组选单式' => 85,
            '后二组选单式' => 85,
            '前二组选和值' => 85,
            '后二组选和值' => 85,
            '前二大小单双' => 6.8,
            '后二大小单双' => 6.8,
            '前三大小单双' => 13.6,
            '后三大小单双' => 13.6,
            '定位胆' => 17


        ),


        80 => array(

            '前五星直选复式' => 180000,
            '前五星直选单式' => 180000,
            '前四直选复式' => 18000,
            '后四直选复式' => 18000,
            '前四直选单式' => 18000,
            '后四直选单式' => 18000,
            '前三直选复式' => 1800,
            '后三直选复式' => 1800,
            '前三直选单式' => 1800,
            '后三直选单式' => 1800,
            '前三直选和值' => 1800,
            '后三直选和值' => 1800,
            '前三组六' => 300,
            '后三组六' => 300,
            '前三组三' => 600,
            '后三组三' => 600,
            '前三混合组选' => array('组三' => 600, '组六' => 300),
            '后三混合组选' => array('组三' => 600, '组六' => 300),
            '前三组选和值' => array('组三' => 600, '组六' => 300),
            '后三组选和值' => array('组三' => 600, '组六' => 300),
            '前二直选复式' => 180,
            '后二直选复式' => 180,
            '前二直选单式' => 180,
            '后二直选单式' => 180,
            '前二直选和值' => 180,
            '后二直选和值' => 180,
            '前二组选复式' => 90,
            '后二组选复式' => 90,
            '前二组选单式' => 90,
            '后二组选单式' => 90,
            '前二组选和值' => 90,
            '后二组选和值' => 90,
            '前二大小单双' => 7.2,
            '后二大小单双' => 7.2,
            '前三大小单双' => 14.4,
            '后三大小单双' => 14.4,
            '定位胆' => 18


        ),

        90 => array(

            '前五星直选复式' => 190000,
            '前五星直选单式' => 190000,
            '前四直选复式' => 19000,
            '后四直选复式' => 19000,
            '前四直选单式' => 19000,
            '后四直选单式' => 19000,
            '前三直选复式' => 1900,
            '后三直选复式' => 1900,
            '前三直选单式' => 1900,
            '后三直选单式' => 1900,
            '前三直选和值' => 1900,
            '后三直选和值' => 1900,
            '前三组六' => 315,
            '后三组六' => 315,
            '前三组三' => 625,
            '后三组三' => 625,
            '前三混合组选' => array('组三' => 625, '组六' => 315),
            '后三混合组选' => array('组三' => 625, '组六' => 315),
            '前三组选和值' => array('组三' => 625, '组六' => 315),
            '后三组选和值' => array('组三' => 625, '组六' => 315),
            '前二直选复式' => 190,
            '后二直选复式' => 190,
            '前二直选单式' => 190,
            '后二直选单式' => 190,
            '前二直选和值' => 190,
            '后二直选和值' => 190,
            '前二组选复式' => 95,
            '后二组选复式' => 95,
            '前二组选单式' => 95,
            '后二组选单式' => 95,
            '前二组选和值' => 95,
            '后二组选和值' => 95,
            '前二大小单双' => 7.6,
            '后二大小单双' => 7.6,
            '前三大小单双' => 15.2,
            '后三大小单双' => 15.2,
            '定位胆' => 19


        )
    ),

    "qxc_bonus_bdw" => array(

        1 => array(
            '前三一码不定位' => 6,
            '后三一码不定位' => 6,
            '后四一码不定位' => 4.6,
            '前四一码不定位' => 4.6,
            '前三二码不定位' => 30,
            '后三二码不定位' => 30,
            '后四二码不定位' => 16,
            '前四二码不定位' => 16,
            '前五星二码不定位' => 10.8,
            '前五星三码不定位' => 37

        ),
        2 => array(
            '前三一码不定位' => 6.6,
            '后三一码不定位' => 6.6,
            '后四一码不定位' => 5.2,
            '前四一码不定位' => 5.2,
            '前三二码不定位' => 33,
            '后三二码不定位' => 33,
            '后四二码不定位' => 18.5,
            '前四二码不定位' => 18.5,
            '前五星二码不定位' => 12,
            '前五星三码不定位' => 41
        )
    ),
    "k8_bonus" => array(
        80 => array(
            "任选一" => 6.5,
            "任选二" => 26,
            "任选三" => array(
                "任选三中三" => 47,
                "任选三中二" => 6
            ),
            "任选四" => array(
                "任选四中四" => 112,
                "任选四中三" => 12,
                "任选四中二" => 3
            ),
            "任选五" => array(
                "任选五中五" => 610,
                "任选五中四" => 51,
                "任选五中三" => 6
            ),
            "任选六" => array(
                "任选六中六" => 1000,
                "任选六中五" => 70,
                "任选六中四" => 10,
                "任选六中三" => 6
            ),
            "任选七" => array(
                "任选七中七" => 10000,
                "任选七中六" => 230,
                "任选七中五" => 30,
                "任选七中四" => 6,
                "任选七中零" => 3
            ),
            "任选八" => array(
                "任选八中八" => 26000,
                "任选八中七" => 1000,
                "任选八中六" => 60,
                "任选八中五" => 15,
                "任选八中四" => 6,
                "任选八中零" => 3
            ),
            "任选九" => array(
                "任选九中九" => 74000,
                "任选九中八" => 7400,
                "任选九中七" => 600,
                "任选九中六" => 60,
                "任选九中五" => 8,
                "任选九中零" => 3
            )
        ),
        90 => array(
            "任选一" => 6.5,
            "任选二" => 26,
            "任选三" => array(
                "任选三中三" => 47,
                "任选三中二" => 6
            ),
            "任选四" => array(
                "任选四中四" => 112,
                "任选四中三" => 12,
                "任选四中二" => 3
            ),
            "任选五" => array(
                "任选五中五" => 610,
                "任选五中四" => 51,
                "任选五中三" => 6
            ),
            "任选六" => array(
                "任选六中六" => 1000,
                "任选六中五" => 70,
                "任选六中四" => 10,
                "任选六中三" => 6
            ),
            "任选七" => array(
                "任选七中七" => 10000,
                "任选七中六" => 230,
                "任选七中五" => 30,
                "任选七中四" => 6,
                "任选七中零" => 3
            ),
            "任选八" => array(
                "任选八中八" => 26000,
                "任选八中七" => 1000,
                "任选八中六" => 60,
                "任选八中五" => 15,
                "任选八中四" => 6,
                "任选八中零" => 3
            ),
            "任选九" => array(
                "任选九中九" => 74000,
                "任选九中八" => 7400,
                "任选九中七" => 600,
                "任选九中六" => 60,
                "任选九中五" => 8,
                "任选九中零" => 3
            )
        )
    ),
    "k3_bonus" => array(
        80 => array(
            "和值" => array(
                "和值3" => 330,
                "和值4" => 115,
                "和值5" => 57,
                "和值6" => 34,
                "和值7" => 23,
                "和值8" => 16,
                "和值9" => 13,
                "和值10" => 12,
                "和值11" => 12,
                "和值12" => 13,
                "和值13" => 16,
                "和值14" => 23,
                "和值15" => 34,
                "和值16" => 57,
                "和值17" => 115,
                "和值18" => 330
            ),
            "和值大" => 3.86,
            "和值小" => 3.86,
            "和值单" => 3.86,
            "和值双" => 3.86,
            "三同号" => array(
                "通选" => 57,
                "单选" => 330
            ),
            "二同号" => array(
                "复选" => 23,
                "单选" => 115
            ),
            "不同号" => array(
                "一不同号" => 3.2,
                "二不同号" => 9,
                "三不同号" => 57
            ),
            "三连号" => array(
                "通选" => 14,
                "单选" => 57
            )
        ),
        90 => array(
            "和值" => array(
                "和值3" => 330,
                "和值4" => 115,
                "和值5" => 57,
                "和值6" => 34,
                "和值7" => 23,
                "和值8" => 16,
                "和值9" => 13,
                "和值10" => 12,
                "和值11" => 12,
                "和值12" => 13,
                "和值13" => 16,
                "和值14" => 23,
                "和值15" => 34,
                "和值16" => 57,
                "和值17" => 115,
                "和值18" => 330
            ),
            "和值大" => 3.86,
            "和值小" => 3.86,
            "和值单" => 3.86,
            "和值双" => 3.86,
            "三同号" => array(
                "通选" => 57,
                "单选" => 330
            ),
            "二同号" => array(
                "复选" => 23,
                "单式" => 115
            ),
            "不同号" => array(
                "一不同号" => 3.2,
                "二不同号" => 9,
                "三不同号" => 57
            ),
            "三连号" => array(
                "通选" => 14,
                "单选" => 57
            )
        )
    ),
    "pk10_bonus" => array(
        70 => array(
            /*"前三名组选复式" => array(
                "前三中三" => 200,
                "前三中二" => 15,
                "前三中一" => 3
            ),
            "前三名组选单式" => array(
                "前三中三" => 200,
                "前三中二" => 15,
                "前三中一" => 3
            ),
            "前二名组选复式" => array(
                "前二中二" => 85,
                "前二中一" => 3
            ),
            "前二名组选单式" => array(
                "前二中二" => 85,
                "前二中一" => 3
            ),*/
            "前三名直选复式" => 1300,
            "前三名直选单式" => 1300,
            "前二名直选复式" => 160,
            "前二名直选单式" => 160,
            "猜冠军" => 17,
            "前三任选三" => 170,
            "前三任选三单式" => 170,
            "前二任选二" => 70,
            "前二任选二单式" => 70,
            "前五定位胆" => 17,
            "后五定位胆" => 17,
            "前三名不定位" => 6.05,
            "第一名大小" => 3.4,
            "第二名大小" => 3.4,
            "第三名大小" => 3.4,
            "第一名单双" => 3.4,
            "第二名单双" => 3.4,
            "第三名单双" => 3.4
        )
    ),

    "xy28_bonus" => array(
        70 => array(
                "0" => 1918.36,
                "1" => 649.5,
                "2" => 328.68,
                "3" => 194.82,
                "4" => 131.46,
                "5" => 93,
                "6" => 70.84,
                "7" => 54.24,
                "8" => 43.82,
                "9" => 35.4,
                "10" => 31.28,
                "11" => 28.12,
                "12" => 26.98,
                "13" => 26.02,
                "14" => 26.28,
                "15" => 26.58,
                "16" => 28.54,
                "17" => 30.88,
                "18" => 35.98,
                "19" => 43.28,
                "20" => 55.1,
                "21" => 69.76,
                "22" => 94.14,
                "23" => 129.88,
                "24" => 197.22,
                "25" => 324.76,
                "26" => 657.1,
                "27" => 1949.62,
                "大" => 4,
                "小" => 4,
                "单" => 4,
                "双" => 4,
                "大单" => 8.2,
                "大双" => 8.2,
                "小单" => 8.2,
                "小双" => 8.2,
                "极大" => 20,
                "极小" => 20
        )
)
)

?>