<?php
/**
 * 时时彩的封锁奖金
 * User: jason
 * Date: 14/12/7
 * Time: 下午12:13
 */

return array(
    "LIMSSC" => array(
        "五星直选复式" => 500000,
        "五星直选单式" => 500000,
        "组选120"     => 200000,
        "组选120"     => 200000,
        "组选60"      => 200000,
        "组选30"      => 200000,
        "组选20"      => 200000,
        "组选10"      => 200000,
        "组选5"       => 200000,
        "一帆风顺"     => 300000,
        "好事成双"     => 300000,
        "三星报喜"     => 300000,
        "四季发财"     => 300000,

        "前四直选复式"  => 300000,
        "前四直选单式"  => 300000,
        "后四直选复式"  => 300000,
        "后四直选单式"  => 300000,
        "组选24"       => 300000,
        "组选12"       => 300000,
        "组选6"        => 300000,
        "组选4"        => 300000,

        "前三直选复式"  => 300000,
        "前三直选单式"  => 300000,
        "前三组三"     => 300000,
        "前三组六"     => 300000,
        "前三组六胆拖"  => 300000,
        "前三混合组选"  => 300000,

        "中三直选复式"  => 300000,
        "中三直选单式"  => 300000,
        "中三组三"     => 300000,
        "中三组六"     => 300000,
        "中三组六胆拖"  => 300000,
        "中三混合组选"  => 300000,

        "后三直选复式"  => 300000,
        "后三直选单式"  => 300000,
        "后三组三"     => 300000,
        "后三组六"     => 300000,
        "后三组六胆拖"  => 300000,
        "后三混合组选"  => 300000,

        "前二直选复式"  => 300000,
        "前二直选单式"  => 300000,
        "前二直选和值"  => 300000,
        "前二组选复式"  => 300000,
        "前二组选单式"  => 300000,
        "前二组选和值"  => 300000,

        "后二直选复式"  => 300000,
        "后二直选单式"  => 300000,
        "后二直选和值"  => 300000,
        "后二组选复式"  => 300000,
        "后二组选单式"  => 300000,
        "后二组选和值"  => 300000,

        "后二大小单双"  => 300000,
        "后三大小单双"  => 300000,
        "前二大小单双"  => 300000,
        "前三大小单双"  => 300000,

        "定位胆"  => 300000,

        "后三一码不定位"  => 300000,
        "前三一码不定位"  => 300000,
        "后三二码不定位"  => 300000,
        "前三二码不定位"  => 300000,

        "后四一码不定位"  => 300000,
        "前四一码不定位"  => 300000,
        "后四二码不定位"  => 300000,
        "前四二码不定位"  => 300000,

        "五星一码不定位"  => 300000,
        "五星二码不定位"  => 300000,
        "五星三码不定位"  => 300000,

        '任二直选复式'    => 300000,
        '任二直选单式'    => 300000,
        '任二直选和值'    => 300000,
        '任二组选复式'    => 300000,
        '任二组选单式'    => 300000,
        '任二组选和值'    => 300000,
        '任三直选复式'    => 300000,
        '任三直选单式'    => 300000,
        '任三直选和值'    => 300000,

        '组三复式'    => 300000,
        '组三单式'    => 300000,
        '组六复式'    => 300000,
        '组六单式'    => 300000,
        '任三混合组选'    => 300000,
        '任三组选和值'    => 300000,

        '任四直选复式'    => 300000,
        '任四直选单式'    => 300000,
        '任四组选24'    => 300000,
        '任四组选12'    => 300000,
        '任四组选6'    => 300000,
        '任四组选4'    => 300000
    )
);