<?php
/**
 * 时时彩的封锁奖金
 * User: jason
 * Date: 14/12/7
 * Time: 下午12:13
 */

return array(
    "LIM3D" => array(
        "直选复式" => 500000,
        "直选单式" => 500000,
        "直选和值" => 200000,
        "组三"    => 200000,
        "组六"    => 200000,
        "混合组选" => 200000,
        "组选和值" => 200000,
        "后二直选复式" => 200000,
        "前二直选复式" => 200000,
        "后二直选单式" => 300000,
        "前二直选单式" => 300000,
        "后二组选复式" => 300000,
        "前二组选复式" => 300000,

        "后二组选单式"  => 300000,
        "前二组选单式"  => 300000,
        "后二大小单双"  => 300000,
        "前二大小单双"  => 300000,
        "三星大小单双"  => 300000,
        "定位胆"       => 300000,
        "一码不定位"   => 300000,
        "二码不定位"   => 300000
    )
);