window.LOTTERYCONF = {
    "11x5": {
        selectItem:[{}],
        orderItem:[],
        addItem:[],
        tabs: [{
            name: "三码",
            id: "3m"
        }, {
            name: "二码",
            id: "2m"
        }, {
            name: "定位胆",
            id: "dwd"
        }, {
            name: "不定位",
            id: "bdw"
        }, {
            name: "定单双",
            id: "dds"
        }, {
            name: "任选",
            id: "rx"
        }],
        search: {
            "3m": [{
                name: "前三",
                games: [{
                    id: "q3mfs",
                    alias:"前三直选复式",
                    name: "直选复式"
                }, {
                    id: "q3mds",
                    alias:"前三直选单式",
                    name: "直选单式"
                }, {
                    id: "q3mzxfs",
                    alias:"前三组选复式",
                    name: "组选复式"
                }, {
                    id: "q3mzxds",
                    alias:"前三组选单式",
                    name: "组选单式"
                }, {
                    id: "q3mzxdt",
                    alias:"前三组选胆拖",
                    name: "组选胆拖"
                }]
            }, {
                name: "后三",
                games: [{
                    id: "h3mfs",
                    alias:"后三直选复式",
                    name: "直选复式"
                }, {
                    id: "h3mds",
                    alias:"后三直选单式",
                    name: "直选单式"
                }, {
                    id: "h3mzxfs",
                    alias:"后三组选复式",
                    name: "组选复式"
                }, {
                    id: "h3mzxds",
                    alias:"后三组选单式",
                    name: "组选单式"
                }, {
                    id: "h3mzxdt",
                    alias:"后三组选胆拖",
                    name: "组选胆拖"
                }]
            }],
            "2m": [{
                name: "前二",
                games: [{
                    id: "q2mfs",
                    alias:"前二直选复式",
                    name: "直选复式"
                }, {
                    id: "q2mds",
                    alias:"前二直选单式",
                    name: "直选单式"
                }, {
                    id: "q2mzxfs",
                    alias:"前二组选复式",
                    name: "组选复式"
                }, {
                    id: "q2mzxds",
                    alias:"前二组选单式",
                    name: "组选单式"
                }, {
                    id: "q2mzxdt",
                    alias:"前二组选胆拖",
                    name: "组选胆拖"
                }]
            }, {
                name: "后二",
                games: [{
                    id: "h2mfs",
                    alias:"后二直选复式",
                    name: "直选复式"
                }, {
                    id: "h2mds",
                    alias:"后二直选单式",
                    name: "直选单式"
                }, {
                    id: "h2mzxfs",
                    alias:"后二组选复式",
                    name: "组选复式"
                }, {
                    id: "h2mzxds",
                    alias:"后二组选单式",
                    name: "组选单式"
                }, {
                    id: "h2mzxdt",
                    alias:"后二组选胆拖",
                    name: "组选胆拖"
                }]
            }],
            dwd: [{
                name: "定位胆",
                games: [{
                    id: "dwd",
                    alias:"定位胆",
                    name: "定位胆"
                }]
            }],
            bdw: [{
                name: "不定位",
                games: [{
                    id: "q31mbdw",
                    alias:"前三一码不定位",
                    name: "前三一码"
                },{
                    id: "h31mbdw",
                    alias:"后三一码不定位",
                    name: "后三一码"
                }]
            }],
            dds: [{
                name: "大小单双",
                games: [{
                    id: "dds",
                    alias:"定单双",
                    name: "定单双"
                }]
            }],
            rx: [{
                name: "任选复式",
                games: [{
                    id: "rx1",
                    alias:"任选一",
                    name: "任选一"
                },{
                    id: "rx2",
                    alias:"任选二",
                    name: "任选二"
                },{
                    id: "rx3",
                    alias:"任选三",
                    name: "任选三"
                },{
                    id: "rx4",
                    alias:"任选四",
                    name: "任选四"
                },{
                    id: "rx5",
                    alias:"任选五",
                    name: "任选五"
                },{
                    id: "rx6",
                    alias:"任选六",
                    name: "任选六"
                },{
                    id: "rx7",
                    alias:"任选七",
                    name: "任选七"
                },{
                    id: "rx8",
                    alias:"任选八",
                    name: "任选八"
                }]
            }, {
                name: "任选单式",
                games: [{
                    id: "rx1ds",
                    alias:"任选一单式",
                    name: "任选一"
                },{
                    id: "rx2ds",
                    alias:"任选二单式",
                    name: "任选二"
                },{
                    id: "rx3ds",
                    alias:"任选三单式",
                    name: "任选三"
                },{
                    id: "rx4ds",
                    alias:"任选四单式",
                    name: "任选四"
                },{
                    id: "rx5ds",
                    alias:"任选五单式",
                    name: "任选五"
                },{
                    id: "rx6ds",
                    alias:"任选六单式",
                    name: "任选六"
                },{
                    id: "rx7ds",
                    alias:"任选七单式",
                    name: "任选七"
                },{
                    id: "rx8ds",
                    alias:"任选八单式",
                    name: "任选八"
                }]
            },{
                name: "任选胆拖",
                games: [{
                    id: "rx2dt",
                    alias:"任选二胆拖",
                    name: "任选二"
                },{
                    id: "rx3dt",
                    alias:"任选三胆拖",
                    name: "任选三"
                },{
                    id: "rx4dt",
                    alias:"任选四胆拖",
                    name: "任选四"
                },{
                    id: "rx5dt",
                    alias:"任选五胆拖",
                    name: "任选五"
                },{
                    id: "rx6dt",
                    alias:"任选六胆拖",
                    name: "任选六"
                },{
                    id: "rx7dt",
                    alias:"任选七胆拖",
                    name: "任选七"
                },{
                    id: "rx8dt",
                    alias:"任选八胆拖",
                    name: "任选八"
                }]
            }]
        },
        games: {
            "q3mfs": {
                describe: {
                    title: "游戏玩法：从01-11共11个号码中选择3个不重复的号码组成一注。",
                    content: "投注方案：1 2 3<br />从01-11共11个号码中选择3个不重复的号码组成一注，所选号码与当期顺序摇出的5个号码中的前3个号码相同，且顺序一致，即为中奖"
                },
                items: [{
                    title: "第一位",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }, {
                    title: "第二位",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }, {
                    title: "第三位",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            "q3mds": {
                describe: {
                    title: "游戏玩法：手动输入3个号码,每一注逗号分开,单注用空格将号码分开。",
                    content: "投注方案：1 2 3,3 4 5<br />手动输入3个号码组成一注，所输入的号码与当期顺序摇出的5个号码中的前3个号码相同，且顺序一致，即为中奖。"
                },
                textarea: !0,
                fn: 'XwDirectFilter',
                limit: 3,
                filter: 'common'
            },
            "q3mzxfs": {
                describe: {
                    title: "游戏玩法：从01-11中共11个号码中选择3个号码。",
                    content: "投注方案：1,2,3<br /> 从01-11总共11个号码中选择3个号码，所选号码与当期顺序摇出的5个号码中的前3个号码相同，顺序不限，即为中奖"
                },
                items: [{
                    title: "组选",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            "q3mzxds": {
                describe: {
                    title: "游戏玩法：手动输入3个号码,每一注逗号分开,单注用空格将号码分开。",
                    content: "投注方案：1 2 3,3 4 5<br />手动输入3个号码组成一注，所输入的号码与当期顺序摇出的5个号码中的前3个号码相同，且顺序一致，即为中奖。"
                },
                textarea: !0,
                fn: 'XwDirectFilter',
                limit: 3,
                filter: 'common'
            },
            "q3mzxdt": {
                describe: {
                    title: "游戏玩法：分别从胆码和拖码的01-11中，至少选择1个胆码和2个拖码组成一注。",
                    content: "投注方案：胆:01拖:02,06<br /> 分别从胆码和拖码的01-11中，至少选择1个胆码和2个拖码组成一注。当期顺序摇出的5个号码中的前3个号码中同时包含所选的1个胆码和2个拖码，顺序不限，即为中奖"
                },
                items: [{
                    title: "胆号",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }, {
                    title: "拖号",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            "h3mfs": {
                describe: {
                    title: "游戏玩法：从01-11共11个号码中选择3个不重复的号码组成一注。",
                    content: "投注方案：1 2 3<br />从01-11共11个号码中选择3个不重复的号码组成一注，所选号码与当期顺序摇出的5个号码中的后3个号码相同，且顺序一致，即为中奖"
                },
                items: [{
                    title: "第三位",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }, {
                    title: "第四位",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }, {
                    title: "第五位",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            "h3mds": {
                describe: {
                    title: "游戏玩法：手动输入3个号码,每一注逗号分开,单注用空格将号码分开。",
                    content: "投注方案：1 2 3,3 4 5<br />手动输入3个号码组成一注，所输入的号码与当期顺序摇出的5个号码中的后3个号码相同，且顺序一致，即为中奖。"
                },
                textarea: !0,
                fn: 'XwDirectFilter',
                limit: 3,
                filter: 'common'
            },
            "h3mzxfs": {
                describe: {
                    title: "游戏玩法：从01-11中共11个号码中选择3个号码。",
                    content: "投注方案：1,2,3<br /> 从01-11总共11个号码中选择3个号码，所选号码与当期顺序摇出的5个号码中的后3个号码相同，顺序不限，即为中奖"
                },
                items: [{
                    title: "组选",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            "h3mzxds": {
                describe: {
                    title: "游戏玩法：手动输入3个号码,每一注逗号分开,单注用空格将号码分开。",
                    content: "投注方案：1 2 3,3 4 5<br />手动输入3个号码组成一注，所输入的号码与当期顺序摇出的5个号码中的后3个号码相同，且顺序一致，即为中奖。"
                },
                textarea: !0,
                fn: 'XwDirectFilter',
                limit: 3,
                filter: 'common'
            },
            "h3mzxdt": {
                describe: {
                    title: "游戏玩法：分别从胆码和拖码的01-11中，至少选择1个胆码和2个拖码组成一注。",
                    content: "投注方案：胆:01拖:02,06<br /> 分别从胆码和拖码的01-11中，至少选择1个胆码和2个拖码组成一注。当期顺序摇出的5个号码中的后3个号码中同时包含所选的1个胆码和2个拖码，顺序不限，即为中奖"
                },
                items: [{
                    title: "胆号",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }, {
                    title: "拖号",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            "q2mds": {
                describe: {
                    title: "游戏玩法：手动输入2个号码,每一注逗号分开,单注用空格将号码分开。",
                    content: "投注方案：1 2,3 4<br /> 手动输入2个号码组成一注，所输入的号码与当期顺序摇出的5个号码中的前2个号码相同，且顺序一致，即为中奖"
                },
                textarea: !0,
                fn: 'XwDirectFilter',
                limit: 3,
                filter: 'common'
            },
            "q2mfs": {
                describe: {
                    title: "游戏玩法：手动输入2个号码组成一注。",
                    content: "投注方案：1,2<br /> 手动输入2个号码组成一注，所输入的号码与当期顺序摇出的5个号码中的前2个号码相同，且顺序一致，即为中奖。<br />玩法奖金：85000"
                },
                items: [{
                    title: "第一位",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                },{
                    title: "第二位",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            "q2mzxfs": {
                describe: {
                    title: "游戏玩法：从01-11中共11个号码中选择2个号码。",
                    content: "投注方案：1,2<br /> 从01-11中共11个号码中选择2个号码，所选号码与当期顺序摇出的5个号码中的前2个号码相同，顺序不限，即为中奖"
                },
                items: [{
                    title: "组选",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            "q2mzxds": {
                describe: {
                    title: "游戏玩法：手动输入2个号码,每一注逗号分开,单注用空格将号码分开。",
                    content: "投注方案：1 2,3 4<br /> 手动输入2个号码组成一注，所输入的号码与当期顺序摇出的5个号码中的前2个号码相同，顺序不限，即为中奖"
                },
                textarea: !0,
                fn: 'XwDirectFilter',
                limit: 3,
                filter: 'common'
            },
            "q2mzxdt": {
                describe: {
                    title: "游戏玩法：分别从胆码和拖码的01-11中，至少选择1个胆码和1个拖码组成一注。",
                    content: "投注方案：胆:01拖:02,06<br /> 分别从胆码和拖码的01-11中，至少选择1个胆码和1个拖码组成一注。当期顺序摇出的5个号码中的前2个号码中同时包含所选的1个胆码和1个拖码，顺序不限，即为中奖"
                },
                items: [{
                    title: "胆号",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }, {
                    title: "拖号",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            "h2mds": {
                describe: {
                    title: "游戏玩法：手动输入2个号码,每一注逗号分开,单注用空格将号码分开。",
                    content: "投注方案：1 2,3 4<br /> 手动输入2个号码组成一注，所输入的号码与当期顺序摇出的5个号码中的后2个号码相同，且顺序一致，即为中奖"
                },
                textarea: !0,
                fn: 'XwDirectFilter',
                limit: 3,
                filter: 'common'
            },
            "h2mfs": {
                describe: {
                    title: "游戏玩法：手动输入2个号码组成一注。",
                    content: "投注方案：1,2<br /> 手动输入2个号码组成一注，所输入的号码与当期顺序摇出的5个号码中的后2个号码相同，且顺序一致，即为中奖。<br />玩法奖金：85000"
                },
                items: [{
                    title: "第四位",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                },{
                    title: "第五位",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            "h2mzxfs": {
                describe: {
                    title: "游戏玩法：从01-11中共11个号码中选择2个号码。",
                    content: "投注方案：1,2<br /> 从01-11中共11个号码中选择2个号码，所选号码与当期顺序摇出的5个号码中的后2个号码相同，顺序不限，即为中奖"
                },
                items: [{
                    title: "组选",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            "h2mzxds": {
                describe: {
                    title: "游戏玩法：手动输入2个号码,每一注逗号分开,单注用空格将号码分开。",
                    content: "投注方案：1 2,3 4<br /> 手动输入2个号码组成一注，所输入的号码与当期顺序摇出的5个号码中的后2个号码相同，顺序不限，即为中奖"
                },
                textarea: !0,
                fn: 'XwDirectFilter',
                limit: 3,
                filter: 'common'
            },
            "h2mzxdt": {
                describe: {
                    title: "游戏玩法：分别从胆码和拖码的01-11中，至少选择1个胆码和1个拖码组成一注。",
                    content: "投注方案：胆:01拖:02,06<br /> 分别从胆码和拖码的01-11中，至少选择1个胆码和1个拖码组成一注。当期顺序摇出的5个号码中的后2个号码中同时包含所选的1个胆码和1个拖码，顺序不限，即为中奖"
                },
                items: [{
                    title: "胆号",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }, {
                    title: "拖号",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            dwd: {
                describe: {
                    title: "游戏玩法：任意1个位置或多个位置上选择1个号码。",
                    content: "投注方案：万位上01<br /> 例：从第一位，第二位，第三位任意1个位置或多个位置上选择1个号码，所选号码与相同位置上的开奖号码一致，即为中奖"
                },
                items: [{
                    title: "第一位",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }, {
                    title: "第二位",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }, {
                    title: "第三位",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }, {
                    title: "第四位",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }, {
                    title: "第五位",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            q31mbdw: {
                describe: {
                    title: "游戏玩法：从01-11共11个号码中选择1个号码进行购买。",
                    content: "投注方案：1<br /> 选择一个号码投注,与开奖数的前三个号码当中的其它一个号相同,即中奖。<br />玩法奖金：85000"
                },
                items: [{
                    title: "前三一码",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            h31mbdw: {
                describe: {
                    title: "游戏玩法：从01-11共11个号码中选择1个号码进行购买。",
                    content: "投注方案：1<br /> 选择一个号码投注,与开奖数的后三个号码当中的其它一个号相同,即中奖。<br />玩法奖金：85000"
                },
                items: [{
                    title: "后三一码",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            dds: {
                describe: {
                    title: "游戏玩法：选择一种大小单双进行购买。",
                    content: "投注方案：4单1双<br /> 您投注的大小单双个数与开奖的一致即为中奖。<br />玩法奖金：85000"
                },
                items: [{
                    title: "定单双",
                    nums: ["5单0双", "4单1双", "3单2双", "2单3双", "1单4双", "0单5双"]
                }]
            },
            "rx1": {
                describe: {
                    title: "游戏玩法：从01-11共11个号码中选择1个号码进行购买。",
                    content: "投注方案：05<br /> 从01-11共11个号码中选择1个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖"
                },
                items: [{
                    title: "任选一",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            "rx2": {
                describe: {
                    title: "游戏玩法：从01-11共11个号码中选择2个号码进行购买。",
                    content: "投注方案：05,04<br /> 从01-11共11个号码中选择2个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖"
                },
                items: [{
                    title: "任选二",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            "rx3": {
                describe: {
                    title: "游戏玩法：从01-11共11个号码中选择3个号码进行购买。",
                    content: "投注方案：05,04,03<br /> 从01-11共11个号码中选择3个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖"
                },
                items: [{
                    title: "任选三",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            "rx4": {
                describe: {
                    title: "游戏玩法：从01-11共11个号码中选择4个号码进行购买。",
                    content: "投注方案：05,04,06,01<br /> 从01-11共11个号码中选择4个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖"
                },
                items: [{
                    title: "任选一",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            "rx5": {
                describe: {
                    title: "游戏玩法：从01-11共11个号码中选择5个号码进行购买。",
                    content: "投注方案：05,01,02,03,04<br /> 从01-11共11个号码中选择5个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖"
                },
                items: [{
                    title: "任选五",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            "rx6": {
                describe: {
                    title: "游戏玩法：从01-11共11个号码中选择6个号码进行购买。",
                    content: "投注方案：05,01,02,03,04,06<br /> 从01-11共11个号码中选择6个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖"
                },
                items: [{
                    title: "任选六",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            "rx7": {
                describe: {
                    title: "游戏玩法：从01-11共11个号码中选择7个号码进行购买。",
                    content: "投注方案：01,02,03,04,05,06,07<br /> 从01-11共11个号码中选择7个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖"
                },
                items: [{
                    title: "任选七",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            "rx8": {
                describe: {
                    title: "游戏玩法：从01-11共11个号码中选择8个号码进行购买。",
                    content: "投注方案：01,02,03,04,05,06,07,08<br /> 从01-11共11个号码中选择8个号码进行购买，只要当期顺序摇出的5个开奖号码中包含所选号码，即为中奖"
                },
                items: [{
                    title: "任选八",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            "rx1ds": {
                describe: {
                    title: "游戏玩法：手动输入1个号码,每一注逗号分开,单注用空格将号码分开。",
                    content: "投注方案：1<br /> 手动输入2个号码组成一注，只要当期顺序摇出的5个开奖号码中包含所选号码，顺序不限，即为中奖"
                },
                textarea: !0,
                fn: 'XwDirectFilter',
                limit: 1,
                filter: 'common'
            },
            "rx2ds": {
                describe: {
                    title: "游戏玩法：手动输入2个号码,每一注逗号分开,单注用空格将号码分开。",
                    content: "投注方案：1 2<br /> 手动输入2个号码组成一注，只要当期顺序摇出的5个开奖号码中包含所选号码，顺序不限，即为中奖"
                },
                textarea: !0,
                fn: 'XwDirectFilter',
                limit: 2,
                filter: 'common'
            },
            "rx3ds": {
                describe: {
                    title: "游戏玩法：手动输入3个号码,每一注逗号分开,单注用空格将号码分开。",
                    content: "投注方案：1 2 3<br /> 手动输入2个号码组成一注，只要当期顺序摇出的5个开奖号码中包含所选号码，顺序不限，即为中奖"
                },
                textarea: !0,
                fn: 'XwDirectFilter',
                limit: 3,
                filter: 'common'
            },
            "rx4ds": {
                describe: {
                    title: "游戏玩法：手动输入4个号码,每一注逗号分开,单注用空格将号码分开。",
                    content: "投注方案：1 2 3 4<br /> 手动输入2个号码组成一注，只要当期顺序摇出的5个开奖号码中包含所选号码，顺序不限，即为中奖"
                },
                textarea: !0,
                fn: 'XwDirectFilter',
                limit: 4,
                filter: 'common'
            },
            "rx5ds": {
                describe: {
                    title: "游戏玩法：手动输入5个号码,每一注逗号分开,单注用空格将号码分开。",
                    content: "投注方案：1 2 3 4 5<br /> 手动输入2个号码组成一注，只要当期顺序摇出的5个开奖号码中包含所选号码，顺序不限，即为中奖"
                },
                textarea: !0,
                fn: 'XwDirectFilter',
                limit: 5,
                filter: 'common'
            },
            "rx6ds": {
                describe: {
                    title: "游戏玩法：手动输入6个号码,每一注逗号分开,单注用空格将号码分开。",
                    content: "投注方案：1 2 3 4 5 6<br /> 手动输入2个号码组成一注，只要当期顺序摇出的5个开奖号码中包含所选号码，顺序不限，即为中奖"
                },
                textarea: !0,
                fn: 'XwDirectFilter',
                limit: 6,
                filter: 'common'
            },
            "rx7ds": {
                describe: {
                    title: "游戏玩法：手动输入7个号码,每一注逗号分开,单注用空格将号码分开。",
                    content: "投注方案：1 2 3 4 5 6 7<br /> 手动输入2个号码组成一注，只要当期顺序摇出的5个开奖号码中包含所选号码，顺序不限，即为中奖"
                },
                textarea: !0,
                fn: 'XwDirectFilter',
                limit: 7,
                filter: 'common'
            },
            "rx8ds": {
                describe: {
                    title: "游戏玩法：手动输入8个号码,每一注逗号分开,单注用空格将号码分开。",
                    content: "投注方案：1 2 3 4 5 6 7 8<br /> 手动输入2个号码组成一注，只要当期顺序摇出的5个开奖号码中包含所选号码，顺序不限，即为中奖"
                },
                textarea: !0,
                fn: 'XwDirectFilter',
                limit: 8,
                filter: 'common'
            },
            "rx2dt": {
                describe: {
                    title: "游戏玩法：分别从胆码和拖码的01-11中，至少选择1个胆码和1个拖码组成一注。",
                    content: "投注方案：胆08拖06<br /> 分别从胆码和拖码的01-11中，至少选择1个胆码和1个拖码组成一注，只要当期顺序摇出的5个开奖号码中同时包含所选的1个胆码和1个拖码，所选胆码必须全中，即为中奖"
                },
                items: [{
                    title: "胆号",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }, {
                    title: "拖号",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            "rx3dt": {
                describe: {
                    title: "游戏玩法：分别从胆码和拖码的01-11中，至少选择1个胆码和2个拖码组成一注。",
                    content: "投注方案：胆08拖06 09<br /> 分别从胆码和拖码的01-11中，至少选择1个胆码和1个拖码组成一注，只要当期顺序摇出的5个开奖号码中同时包含所选的1个胆码和2个拖码，所选胆码必须全中，即为中奖"
                },
                items: [{
                    title: "胆号",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }, {
                    title: "拖号",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            "rx4dt": {
                describe: {
                    title: "游戏玩法：分别从胆码和拖码的01-11中，至少选择1个胆码和3个拖码组成一注。",
                    content: "投注方案：胆08拖06 05 04<br /> 分别从胆码和拖码的01-11中，至少选择1个胆码和1个拖码组成一注，只要当期顺序摇出的5个开奖号码中同时包含所选的1个胆码和3个拖码，所选胆码必须全中，即为中奖"
                },
                items: [{
                    title: "胆号",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }, {
                    title: "拖号",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            "rx5dt": {
                describe: {
                    title: "游戏玩法：分别从胆码和拖码的01-11中，至少选择1个胆码和4个拖码组成一注。",
                    content: "投注方案：胆08拖06 01 02 03<br /> 分别从胆码和拖码的01-11中，至少选择1个胆码和1个拖码组成一注，只要当期顺序摇出的5个开奖号码同时存在于胆码和拖码的任意组合中，所选胆码必须全中，即为中奖"
                },
                items: [{
                    title: "胆号",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }, {
                    title: "拖号",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            "rx6dt": {
                describe: {
                    title: "游戏玩法：分别从胆码和拖码的01-11中，至少选择1个胆码和5个拖码组成一注。",
                    content: "投注方案：胆08拖06 01 02 03 04<br /> 分别从胆码和拖码的01-11中，至少选择1个胆码和1个拖码组成一注，只要当期顺序摇出的5个开奖号码同时存在于胆码和拖码的任意组合中，所选胆码必须全中，即为中奖"
                },
                items: [{
                    title: "胆号",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }, {
                    title: "拖号",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            "rx7dt": {
                describe: {
                    title: "游戏玩法：分别从胆码和拖码的01-11中，至少选择1个胆码和6个拖码组成一注。",
                    content: "投注方案：胆08拖01 02 03 04 05 06<br /> 分别从胆码和拖码的01-11中，至少选择1个胆码和1个拖码组成一注，只要当期顺序摇出的5个开奖号码同时存在于胆码和拖码的任意组合中，所选胆码必须全中，即为中奖"
                },
                items: [{
                    title: "胆号",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }, {
                    title: "拖号",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            },
            "rx8dt": {
                describe: {
                    title: "游戏玩法：分别从胆码和拖码的01-11中，至少选择1个胆码和7个拖码组成一注。",
                    content: "投注方案：胆08拖01 02 03 04 05 06 07<br /> 分别从胆码和拖码的01-11中，至少选择1个胆码和1个拖码组成一注，只要当期顺序摇出的5个开奖号码同时存在于胆码和拖码的任意组合中，所选胆码必须全中，即为中奖"
                },
                items: [{
                    title: "胆号",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }, {
                    title: "拖号",
                    tools: [{
                        name: "全",
                        fn: '1'
                    }, {
                        name: "大",
                        fn: '2'
                    }, {
                        name: "小",
                        fn: '3'
                    }, {
                        name: "奇",
                        fn: '4'
                    }, {
                        name: "偶",
                        fn: '5'
                    }, {
                        name: "清",
                        fn: '6'
                    }],
                    nums: ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"]
                }]
            }
        }
    }
}

var e = null,
    display = $('div.lm0'),  // 显示面板容器
    games = $("#barea_tab"), // 玩法统称
    gamec = $("#game_search"),// 玩法统称下的具体玩法
    gamen = $("#game_betting"),// 号码选择区
    howtoplay = $("#howtoplay"),
    $lid = $('input[name=lid]').val(),
    prize = $("select[name=prize]"),
    cartlist = $('#cartlist'),
    r = LOTTERYCONF[$('#lottery_id').val()];// 获取玩法的配置参数
!(function(win){
    var ssc = {
        NoticeSlider: function()
        {
            $("#J__noticeSlider").textScroll(); // 公告滚动
        }
        ,lossLine: function()
        {
            $(".J__filter-lossLine").hover(function(){
                $(this).toggleClass("active");
                $(this).find(".selectLists").stop(true).slideToggle(300);
            });
        }
        ,TrHover: function()
        {
            $("#J__trHover tr").hover(function(){
                $(this).addClass("on");
            }, function(){
                $(this).removeClass("on");
            });
        }
        ,LotteryRecord: function()
        {
            $(".J__lotteryRecord").hover(function(){
                $(this).toggleClass("active");
                $(this).find(".lotteryRecord-list").stop(true).slideToggle(300);
            });
        }
        ,PopHelp: function()
        {
            $(".J__popHelp").hover(function(){
                $(this).toggleClass("active");
                $(this).find(".cont").stop(true).slideToggle(300);
            });
        }
        ,SelUnit: function()
        {
            $("#J__selUnit i").on("click", function(){
                $(this).addClass("on").siblings().removeClass("on");
                mode = $(this).attr("data-field");
                $singermoneyval = $("#singermoney")
                $singernoteval = parseInt($("#singernote").text())
                $multipleval = parseInt($('input[name=multiple]').val())
                switch (parseInt(mode))
                {
                    case 0:
                        $modelCurrentMoney = $singernoteval*$multipleval*2
                        break;
                    case 1:
                        $modelCurrentMoney = $singernoteval*$multipleval*2/10
                        break;
                    case 2:
                        $modelCurrentMoney = $singernoteval*$multipleval*2/100
                        break;
                    case 3:
                        $modelCurrentMoney = $singernoteval*$multipleval*2/1000
                        break;
                }
                $singermoneyval.text($modelCurrentMoney)
                r.selectItem[0].model = mode
                r.selectItem[0].singermoney = $modelCurrentMoney
            });
        }
        ,Loading: function()
        {
            // 页面加载
            imagesLoaded('.JszContent',function(){
                ssc.LoadingAfter()
                /*todo 初始点击事件*/
                games.on("click", "a", function(c) {
                    var n = $(c.target);
                    n.hasClass("on") || (e = n.attr("id"), $(".on", games).removeClass("on"), n.addClass("on"), ssc.gamea({
                        search: r.search[e],
                        on: r.search[e][0].games[0].id
                    }), ssc.gamet({
                        games: r.games[r.search[e][0].games[0].id]
                    }), ssc.gamem({
                        bonus: r.bonus,
                        bonuslevel: r.selectItem[0].bonusLevel
                    },r.search[e][0]['games'][0]['alias']),ssc.initSetDefaultOption(e))
                }), $("#game_search").on("click", "a", function(s) {
                    ssc.gamea({
                        search: r.search[e],
                        on: s.target.id
                    }), ssc.gamet({
                        games: r.games[s.target.id]
                    }), ssc.gamem({
                        bonus: r.bonus,
                        bonuslevel: r.selectItem[0].bonusLevel
                    },$(s.target).attr('data-field')), ssc.t_oninput($(s.target).attr('data-field')),ssc.emptyText(),ssc.filterData(),ssc.importFile(),ssc.init({
                        "playname":$(s.target).attr('data-field')
                        ,"showplayname":$(s.target).text()
                    })
                }),games.html(tpl("#tabs_tpl", r)).find("a:eq(0)").trigger("click")

                $('#game_betting').on('click', '.lottery-ball', function(event) {
                    var $target = $(event.target)
                    $target[$target.hasClass('on') ? 'removeClass' : 'addClass']('on')
                    ssc.calculateMultipleNote()
                    event.stopPropagation()
                }).on('click', '.lottery-ball-other', function(e) {
                    var $target = $(e.target)
                    var $balls = $target.closest('li').find('.lottery-ball')
                    var max = Math.round($balls.length / 2)
                    switch ($target.attr('data-fn')) {
                        case '1':
                            $balls.addClass('on')
                            break
                        case '2':
                            $.each($balls, function(i, d) {
                                $(d)[i > max - 1 ? 'addClass' : 'removeClass']('on')
                            })
                            break
                        case '3':
                            $.each($balls, function(i, d) {
                                $(d)[i < max ? 'addClass' : 'removeClass']('on')
                            })
                            break
                        case '4':
                            $.each($balls, function(i, d) {
                                $(d)[parseInt($(d).text()) % 2 > 0 ? 'addClass' : 'removeClass']('on')
                            })
                            break
                        case '5':
                            $.each($balls, function(i, d) {
                                $(d)[parseInt($(d).text()) % 2 < 1 ? 'addClass' : 'removeClass']('on')
                            })
                            break
                        case '6':
                            $balls.removeClass('on')
                            break
                    }
                    ssc.calculateMultipleNote()
                })

                /*todo 前二组选复式*/
                window.q2zxfs = function() {
                    $select = window.select
                    $count = $select[0]
                    if ($count < 2) return 0
                    var chushu = 1,
                        beichushu = 1,
                        sheshu = 1;
                    for (var num = $count; num > 0; num--) {
                        chushu *= num;
                    }
                    for (var bnum = 2; bnum > 0; bnum--) {
                        beichushu *= bnum;
                    }
                    for (var xnum = ($count - 2); xnum > 0; xnum--) {
                        sheshu *= xnum;
                    }
                    return parseInt(chushu) / (parseInt(beichushu) * parseInt(sheshu))
                }

                /*todo 前二组选胆拖*/
                window.q2zxdt = function() {
                    $select = window.select;
                    $count1 = $select[0]
                    $count2 = $select[1]
                    var desc = 0,
                        add = 0,
                        c = 1,
                        n = 1,
                        m = 1

                    $selectRowsNumber = window.selectRowsNumber
                    $rowsNumber = $selectRowsNumber.split(",")
                    $c2arr = $rowsNumber[1].split(" ")
                    if (jQuery.inArray($rowsNumber[0], $c2arr) != -1) {
                        $("#J__selNums li:eq(0)").find(".lottery-ball[data-val="+$c1arr[o]+"]").removeClass('on')
                        return 0;
                    }

                    desc = 2 - parseFloat($count1);
                    add = parseFloat($count2) + parseFloat($count1);
                    if (parseFloat($count1) != 1) {
                        alertify.error("<div class='text'><i class='ico-error'></i>胆码个数只能选择1个<i class='err-close'></i></div>")
                        $("#J__selNums li:eq(0)").find(".lottery-ball").removeClass('on')
                    }
                    if (add < 2 || parseFloat($count1) != 1 || $count2 < 1) return 0
                    for (var i = $count2; i > 0; i--) {
                        c *= i;
                    }
                    for (var k = desc; k > 0; k--) {
                        m *= k;
                    }
                    for (var j = ($count2 - desc); j > 0; j--) {
                        n *= j;
                    }
                    return c / (n * m)
                }

                /*todo 前三组选复式*/
                window.q3zxfs = function() {
                    $select = window.select;
                    $count = $select[0]
                    if ($count < 3) return 0
                    var chushu = 1,
                        beichushu = 1,
                        sheshu = 1;
                    for (var num = $count; num > 0; num--) {
                        chushu *= num;
                    }
                    for (var bnum = 3; bnum > 0; bnum--) {
                        beichushu *= bnum;
                    }
                    for (var xnum = ($count - 3); xnum > 0; xnum--) {
                        sheshu *= xnum;
                    }
                    return parseInt(chushu) / (parseInt(beichushu) * parseInt(sheshu))
                }

                /*todo 前三组选胆拖*/
                window.q3zxdt = function() {
                    $select = window.select;
                    $count1 = $select[0]
                    $count2 = $select[1]
                    var desc = 0,
                        add = 0,
                        c = 1,
                        n = 1,
                        m = 1

                    $selectRowsNumber = window.selectRowsNumber
                    $rowsNumber = $selectRowsNumber.split(",")
                    $c2arr = $rowsNumber[1].split(" ")
                    if (jQuery.inArray($rowsNumber[0], $c2arr) != -1) {
                        $("#J__selNums li:eq(0)").find(".lottery-ball[data-val="+$c1arr[o]+"]").removeClass('on')
                        return 0;
                    }

                    desc = 3 - parseFloat($count1);
                    add = parseFloat($count2) + parseFloat($count1);
                    if (parseFloat($count1) > 2) {
                        alertify.error("<div class='text'><i class='ico-error'></i>胆码个数只能选择1个或者2个<i class='err-close'></i></div>")
                        $("#J__selNums li:eq(0)").find(".lottery-ball").removeClass('on')
                    }
                    if (add < 3 || parseFloat($count1) > 2 || $count2 < 1) return 0
                    for (var i = $count2; i > 0; i--) {
                        c *= i;
                    }
                    for (var k = desc; k > 0; k--) {
                        m *= k;
                    }
                    for (var j = ($count2 - desc); j > 0; j--) {
                        n *= j;
                    }
                    return c / (n * m)
                }

                /*todo 前三一码不定位*/
                window.q31mbdw = function() {
                    $select = window.select
                    $count = $select[0]
                    if ($count < 1) return 0
                    var chushu = 1,
                        beichushu = 1,
                        sheshu = 1;
                    for (var num = $count; num > 0; num--) {
                        chushu *= num;
                    }
                    for (var bnum = 1; bnum > 0; bnum--) {
                        beichushu *= bnum;
                    }
                    for (var xnum = ($count - 1); xnum > 0; xnum--) {
                        sheshu *= xnum;
                    }
                    return parseInt(chushu) / (parseInt(beichushu) * parseInt(sheshu))
                }

                /*todo 定单双*/
                window.dds = function() {
                    $select = window.select;
                    $count = $select[0]
                    if ($count < 1) return 0
                    return $count
                }

                /*todo 任选一*/
                window.rx1 = function() {
                    $select = window.select
                    $count = $select[0]
                    $num = 1, a = b = c = 1
                    if ($count < $num) return 0
                    for (var j = $count; j > 0; j--) {
                        a *= j;
                    }
                    if (parseInt($count) - parseInt($num) == 0) {
                        b = 1;
                    } else {
                        for (var k = (parseInt($count) - parseInt($num)); k > 0; k--) {
                            b *= k;
                        }
                    }
                    for (var m = $num; m > 0; m--) {
                        c *= m;
                    }
                    return parseInt(a / (b * c))
                }

                /*todo 任选二*/
                window.rx2 = function() {
                    $select = window.select
                    $count = $select[0]
                    $num = 2, a = b = c = 1
                    if ($count < $num) return 0
                    for (var j = $count; j > 0; j--) {
                        a *= j;
                    }
                    if (parseInt($count) - parseInt($num) == 0) {
                        b = 1;
                    } else {
                        for (var k = (parseInt($count) - parseInt($num)); k > 0; k--) {
                            b *= k;
                        }
                    }
                    for (var m = $num; m > 0; m--) {
                        c *= m;
                    }
                    return parseInt(a / (b * c))
                }

                /*todo 任选三*/
                window.rx3 = function() {
                    $select = window.select
                    $count = $select[0]
                    $num = 3, a = b = c = 1
                    if ($count < $num) return 0
                    for (var j = $count; j > 0; j--) {
                        a *= j;
                    }
                    if (parseInt($count) - parseInt($num) == 0) {
                        b = 1;
                    } else {
                        for (var k = (parseInt($count) - parseInt($num)); k > 0; k--) {
                            b *= k;
                        }
                    }
                    for (var m = $num; m > 0; m--) {
                        c *= m;
                    }
                    return parseInt(a / (b * c))
                }

                /*todo 任选四*/
                window.rx4 = function() {
                    $select = window.select
                    $count = $select[0]
                    $num = 4, a = b = c = 1
                    if ($count < $num) return 0
                    for (var j = $count; j > 0; j--) {
                        a *= j;
                    }
                    if (parseInt($count) - parseInt($num) == 0) {
                        b = 1;
                    } else {
                        for (var k = (parseInt($count) - parseInt($num)); k > 0; k--) {
                            b *= k;
                        }
                    }
                    for (var m = $num; m > 0; m--) {
                        c *= m;
                    }
                    return parseInt(a / (b * c))
                }

                /*todo 任选五*/
                window.rx5 = function() {
                    $select = window.select
                    $count = $select[0]
                    $num = 5, a = b = c = 1
                    if ($count < $num) return 0
                    for (var j = $count; j > 0; j--) {
                        a *= j;
                    }
                    if (parseInt($count) - parseInt($num) == 0) {
                        b = 1;
                    } else {
                        for (var k = (parseInt($count) - parseInt($num)); k > 0; k--) {
                            b *= k;
                        }
                    }
                    for (var m = $num; m > 0; m--) {
                        c *= m;
                    }
                    return parseInt(a / (b * c))
                }

                /*todo 任选六*/
                window.rx6 = function() {
                    $select = window.select
                    $count = $select[0]
                    $num = 6, a = b = c = 1
                    if ($count < $num) return 0
                    for (var j = $count; j > 0; j--) {
                        a *= j;
                    }
                    if (parseInt($count) - parseInt($num) == 0) {
                        b = 1;
                    } else {
                        for (var k = (parseInt($count) - parseInt($num)); k > 0; k--) {
                            b *= k;
                        }
                    }
                    for (var m = $num; m > 0; m--) {
                        c *= m;
                    }
                    return parseInt(a / (b * c))
                }

                /*todo 任选七*/
                window.rx7 = function() {
                    $select = window.select
                    $count = $select[0]
                    $num = 7, a = b = c = 1
                    if ($count < $num) return 0
                    for (var j = $count; j > 0; j--) {
                        a *= j;
                    }
                    if (parseInt($count) - parseInt($num) == 0) {
                        b = 1;
                    } else {
                        for (var k = (parseInt($count) - parseInt($num)); k > 0; k--) {
                            b *= k;
                        }
                    }
                    for (var m = $num; m > 0; m--) {
                        c *= m;
                    }
                    return parseInt(a / (b * c))
                }

                /*todo 任选八*/
                window.rx8 = function() {
                    $select = window.select
                    $count = $select[0]
                    $num = 8, a = b = c = 1
                    if ($count < $num) return 0
                    for (var j = $count; j > 0; j--) {
                        a *= j;
                    }
                    if (parseInt($count) - parseInt($num) == 0) {
                        b = 1;
                    } else {
                        for (var k = (parseInt($count) - parseInt($num)); k > 0; k--) {
                            b *= k;
                        }
                    }
                    for (var m = $num; m > 0; m--) {
                        c *= m;
                    }
                    return parseInt(a / (b * c))
                }

                /*todo 任选二胆拖*/
                window.rx2dt = function() {
                    $select = window.select;
                    $count1 = $select[0]
                    $count2 = $select[1]
                    $u = 2
                    var desc = 0,
                        add = 0,
                        c = 1,
                        n = 1,
                        m = 1

                    $selectRowsNumber = window.selectRowsNumber
                    $rowsNumber = $selectRowsNumber.split(",")
                    $c2arr = $rowsNumber[1].split(" ")
                    if ($rowsNumber[0] != "") {
                        $c1arr = $rowsNumber[0].split(" ")
                        for (var o in $c1arr) {
                            if (jQuery.inArray($c1arr[o], $c2arr) != -1) {
                                $("#J__selNums li:eq(0)").find(".lottery-ball[data-val="+$c1arr[o]+"]").removeClass('on')
                                return 0;

                            }
                        }

                    }

                    desc = $u - parseFloat($count1);
                    add = parseFloat($count2) + parseFloat($count1);
                    if (parseFloat($count1) != 1) {
                        alertify.error("<div class='text'><i class='ico-error'></i>胆码个数只能选择1个胆码"+($u - 1)+"个拖码<i class='err-close'></i></div>")
                        $("#J__selNums li:eq(0)").find(".lottery-ball").removeClass('on')
                    }
                    if (add < $u || parseFloat($count1) < 1 || $count2 < ($u - 1)) return 0
                    for (var i = $count2; i > 0; i--) {
                        c *= i;
                    }
                    for (var k = desc; k > 0; k--) {
                        m *= k;
                    }
                    for (var j = ($count2 - desc); j > 0; j--) {
                        n *= j;
                    }
                    return c / (n * m)
                }

                /*todo 任选三胆拖*/
                window.rx3dt = function() {
                    $select = window.select;
                    $count1 = $select[0]
                    $count2 = $select[1]
                    $u = 3
                    var desc = 0,
                        add = 0,
                        c = 1,
                        n = 1,
                        m = 1

                    $selectRowsNumber = window.selectRowsNumber
                    $rowsNumber = $selectRowsNumber.split(",")
                    $c2arr = $rowsNumber[1].split(" ")
                    if ($rowsNumber[0] != "") {
                        $c1arr = $rowsNumber[0].split(" ")
                        for (var o in $c1arr) {
                            if (jQuery.inArray($c1arr[o], $c2arr) != -1) {
                                $("#J__selNums li:eq(0)").find(".lottery-ball[data-val="+$c1arr[o]+"]").removeClass('on')
                                return 0;
                            }
                        }

                    }

                    desc = $u - parseFloat($count1);
                    add = parseFloat($count2) + parseFloat($count1);
                    if (parseFloat($count1) != 1) {
                        alertify.error("<div class='text'><i class='ico-error'></i>胆码个数只能选择1个胆码"+($u - 1)+"个拖码<i class='err-close'></i></div>")
                        $("#J__selNums li:eq(0)").find(".lottery-ball").removeClass('on')
                    }
                    if (add < $u || parseFloat($count1) < 1 || $count2 < ($u - 1)) return 0
                    for (var i = $count2; i > 0; i--) {
                        c *= i;
                    }
                    for (var k = desc; k > 0; k--) {
                        m *= k;
                    }
                    for (var j = ($count2 - desc); j > 0; j--) {
                        n *= j;
                    }
                    return c / (n * m)
                }

                /*todo 任选四胆拖*/
                window.rx4dt = function() {
                    $select = window.select;
                    $count1 = $select[0]
                    $count2 = $select[1]
                    $u = 4
                    var desc = 0,
                        add = 0,
                        c = 1,
                        n = 1,
                        m = 1

                    $selectRowsNumber = window.selectRowsNumber
                    $rowsNumber = $selectRowsNumber.split(",")
                    $c2arr = $rowsNumber[1].split(" ")
                    if ($rowsNumber[0] != "") {
                        $c1arr = $rowsNumber[0].split(" ")
                        for (var o in $c1arr) {
                            if (jQuery.inArray($c1arr[o], $c2arr) != -1) {
                                $("#J__selNums li:eq(0)").find(".lottery-ball[data-val="+$c1arr[o]+"]").removeClass('on')
                                return 0;
                            }
                        }

                    }

                    desc = $u - parseFloat($count1);
                    add = parseFloat($count2) + parseFloat($count1);
                    if (parseFloat($count1) != 1) {
                        alertify.error("<div class='text'><i class='ico-error'></i>胆码个数只能选择1个胆码"+($u - 1)+"个拖码<i class='err-close'></i></div>")
                        $("#J__selNums li:eq(0)").find(".lottery-ball").removeClass('on')
                    }
                    if (add < $u || parseFloat($count1) < 1 || $count2 < ($u - 1)) return 0
                    for (var i = $count2; i > 0; i--) {
                        c *= i;
                    }
                    for (var k = desc; k > 0; k--) {
                        m *= k;
                    }
                    for (var j = ($count2 - desc); j > 0; j--) {
                        n *= j;
                    }
                    return c / (n * m)
                }

                /*todo 任选五胆拖*/
                window.rx5dt = function() {
                    $select = window.select;
                    $count1 = $select[0]
                    $count2 = $select[1]
                    $u = 5
                    var desc = 0,
                        add = 0,
                        c = 1,
                        n = 1,
                        m = 1

                    $selectRowsNumber = window.selectRowsNumber
                    $rowsNumber = $selectRowsNumber.split(",")
                    $c2arr = $rowsNumber[1].split(" ")
                    if ($rowsNumber[0] != "") {
                        $c1arr = $rowsNumber[0].split(" ")
                        for (var o in $c1arr) {
                            if (jQuery.inArray($c1arr[o], $c2arr) != -1) {
                                $("#J__selNums li:eq(0)").find(".lottery-ball[data-val="+$c1arr[o]+"]").removeClass('on')
                                return 0;
                            }
                        }

                    }

                    desc = $u - parseFloat($count1);
                    add = parseFloat($count2) + parseFloat($count1);
                    if (parseFloat($count1) != 1) {
                        alertify.error("<div class='text'><i class='ico-error'></i>胆码个数只能选择1个胆码"+($u - 1)+"个拖码<i class='err-close'></i></div>")
                        $("#J__selNums li:eq(0)").find(".lottery-ball").removeClass('on')
                    }
                    if (add < $u || parseFloat($count1) < 1 || $count2 < ($u - 1)) return 0
                    for (var i = $count2; i > 0; i--) {
                        c *= i;
                    }
                    for (var k = desc; k > 0; k--) {
                        m *= k;
                    }
                    for (var j = ($count2 - desc); j > 0; j--) {
                        n *= j;
                    }
                    return c / (n * m)
                }

                /*todo 任选六胆拖*/
                window.rx6dt = function() {
                    $select = window.select;
                    $count1 = $select[0]
                    $count2 = $select[1]
                    $u = 6
                    var desc = 0,
                        add = 0,
                        c = 1,
                        n = 1,
                        m = 1

                    $selectRowsNumber = window.selectRowsNumber
                    $rowsNumber = $selectRowsNumber.split(",")
                    $c2arr = $rowsNumber[1].split(" ")
                    if ($rowsNumber[0] != "") {
                        $c1arr = $rowsNumber[0].split(" ")
                        for (var o in $c1arr) {
                            if (jQuery.inArray($c1arr[o], $c2arr) != -1) {
                                $("#J__selNums li:eq(0)").find(".lottery-ball[data-val="+$c1arr[o]+"]").removeClass('on')
                                return 0;
                            }
                        }

                    }

                    desc = $u - parseFloat($count1);
                    add = parseFloat($count2) + parseFloat($count1);
                    if (parseFloat($count1) != 1) {
                        alertify.error("<div class='text'><i class='ico-error'></i>胆码个数只能选择1个胆码"+($u - 1)+"个拖码<i class='err-close'></i></div>")
                        $("#J__selNums li:eq(0)").find(".lottery-ball").removeClass('on')
                    }
                    if (add < $u || parseFloat($count1) < 1 || $count2 < ($u - 1)) return 0
                    for (var i = $count2; i > 0; i--) {
                        c *= i;
                    }
                    for (var k = desc; k > 0; k--) {
                        m *= k;
                    }
                    for (var j = ($count2 - desc); j > 0; j--) {
                        n *= j;
                    }
                    return c / (n * m)
                }

                /*todo 任选七胆拖*/
                window.rx7dt = function() {
                    $select = window.select;
                    $count1 = $select[0]
                    $count2 = $select[1]
                    $u = 7
                    var desc = 0,
                        add = 0,
                        c = 1,
                        n = 1,
                        m = 1

                    $selectRowsNumber = window.selectRowsNumber
                    $rowsNumber = $selectRowsNumber.split(",")
                    $c2arr = $rowsNumber[1].split(" ")
                    if ($rowsNumber[0] != "") {
                        $c1arr = $rowsNumber[0].split(" ")
                        for (var o in $c1arr) {
                            if (jQuery.inArray($c1arr[o], $c2arr) != -1) {
                                $("#J__selNums li:eq(0)").find(".lottery-ball[data-val="+$c1arr[o]+"]").removeClass('on')
                                return 0;
                            }
                        }

                    }

                    desc = $u - parseFloat($count1);
                    add = parseFloat($count2) + parseFloat($count1);
                    if (parseFloat($count1) != 1) {
                        alertify.error("<div class='text'><i class='ico-error'></i>胆码个数只能选择1个胆码"+($u - 1)+"个拖码<i class='err-close'></i></div>")
                        $("#J__selNums li:eq(0)").find(".lottery-ball").removeClass('on')
                    }
                    if (add < $u || parseFloat($count1) < 1 || $count2 < ($u - 1)) return 0
                    for (var i = $count2; i > 0; i--) {
                        c *= i;
                    }
                    for (var k = desc; k > 0; k--) {
                        m *= k;
                    }
                    for (var j = ($count2 - desc); j > 0; j--) {
                        n *= j;
                    }
                    return c / (n * m)
                }

                /*todo 任选八胆拖*/
                window.rx8dt = function() {
                    $select = window.select;
                    $count1 = $select[0]
                    $count2 = $select[1]
                    $u = 8
                    var desc = 0,
                        add = 0,
                        c = 1,
                        n = 1,
                        m = 1

                    $selectRowsNumber = window.selectRowsNumber
                    $rowsNumber = $selectRowsNumber.split(",")
                    $c2arr = $rowsNumber[1].split(" ")
                    if ($rowsNumber[0] != "") {
                        $c1arr = $rowsNumber[0].split(" ")
                        for (var o in $c1arr) {
                            if (jQuery.inArray($c1arr[o], $c2arr) != -1) {
                                $("#J__selNums li:eq(0)").find(".lottery-ball[data-val="+$c1arr[o]+"]").removeClass('on')
                                return 0;
                            }
                        }

                    }

                    desc = $u - parseFloat($count1);
                    add = parseFloat($count2) + parseFloat($count1);
                    if (parseFloat($count1) != 1) {
                        alertify.error("<div class='text'><i class='ico-error'></i>胆码个数只能选择1个胆码"+($u - 1)+"个拖码<i class='err-close'></i></div>")
                        $("#J__selNums li:eq(0)").find(".lottery-ball").removeClass('on')
                    }
                    if (add < $u || parseFloat($count1) < 1 || $count2 < ($u - 1)) return 0
                    for (var i = $count2; i > 0; i--) {
                        c *= i;
                    }
                    for (var k = desc; k > 0; k--) {
                        m *= k;
                    }
                    for (var j = ($count2 - desc); j > 0; j--) {
                        n *= j;
                    }
                    return c / (n * m)
                }
                /*todo 追号计划*/
                $('a[data-method="chase"]').on('click',function(e) {
                    r.addItem = []
                    $num = $("li",cartlist).length
                    if(r.orderItem.length==0 || $num==0) return
                    if(r.orderItem.length>1 && $num>1)
                    {
                        alertify.error("<div class='text'><i class='ico-error'></i>只能对单一订单追号<i class='err-close'></i></div>")
                    }
                    else
                    {
                        $.post("/futureLottery",{"id":$lid},function(data){
                            if(data.length>0)
                            {
                                $.dialog.util.alert({
                                    title: "追号",
                                    width: 800,
                                    height:500,
                                    btnText:['追号购买'],
                                    height: "auto"
                                }).ready(function(t) {
                                    t.html(tpl("#chase_tpl",{rows:[data]}))
                                    $('.chase_list').perfectScrollbar({
                                        height: 300
                                    })
                                    ssc.addperiodsChange()
                                    $('button[data-method="createAddList"]').bind("click",function(){
                                        type=""
                                        $("#menu0").find("li").each(function(){
                                            if($(this).hasClass("hover"))
                                            {
                                                type = $(this).attr("aria-controls")
                                            }
                                        })
                                        if(type=="t1")
                                            ssc.createWithTimes(type)
                                        else if(type=="t2")
                                            ssc.createDouble(type)
                                        else if(type=="t3")
                                            ssc.createProfit(type)
                                        ssc.calculateAddListItem()
                                    })
                                    $('button[data-method="addBuy"]').on("click", function(){
                                        ssc.addOrderSubmit()
                                        r.addItem=[]
                                        $.dialog.close("*")
                                    })
                                }).close(function(){
                                    r.addItem=[]
                                    $.dialog.close("*")
                                    return;
                                })
                            }
                        },'json')
                    }
                })
            })
        }
        ,LoadingAfter: function()
        {
            // 页面加载之后执行初始化
            $(".loader").remove();
            $("body").removeClass('body-bg')
            $(".JszContent").show();
            ssc.RefreshMoney(),ssc.Logout(),ssc.displayPanl(),ssc.socketEvent(),ssc.SelUnit()
            ssc.xySlider(),ssc.Dropdown(),ssc.NavMenu(),ssc.NoticeSlider(),ssc.lossLine(),ssc.FloatToolbar(),ssc.FloatAddToolbar()
        }
        ,FloatToolbar: function()
        {
            $(".J__floatToolbar").hover(function(){
                $(this).find(".popup__floatBox").stop(true).fadeIn(200);
            }, function(){
                $(this).find(".popup__floatBox").stop(true).hide();
            });
        }
        ,FloatAddToolbar: function()
        {
            $(".J__floatAddToolbar").hover(function(){
                $(this).find(".popup__floatBox_add").stop(true).fadeIn(200);
            }, function(){
                $(this).find(".popup__floatBox_add").stop(true).hide();
            });
        }
        ,RefreshMoney: function()
        {
            // 金额刷新
            $(".getnewmoney").bind("click",function(){
                $.post("/getMoney",function(money){
                    var arr = money.split('-')
                    $(".usermoney").html("可用余额 ￥"+arr[0]);
                    $(".wallet_account").html("分红钱包 ￥"+arr[1]);
                },"text")
            })
        }
        ,getMoney: function()
        {
            $.post("/getMoney",function(money){
                var arr = money.split('-')
                $(".usermoney").html("可用余额 ￥"+arr[0]);
                $(".wallet_account").html("分红钱包 ￥"+arr[1]);
            },"text")
        }
        ,Logout: function()
        {
            // 退出系统
            $.dialog.close('*');
            $(document).on('click', 'a[data-method=out]', function(e) {
                $uid = $('input[name=uid]').val()
                layui.use('layer', function(layer){
                    var index = layer.confirm('确定要退出系统吗？', {
                        btn: ['退出','玩一会'] 
                        ,anim:3
                        ,btnAlign: 'c'
                        }, function(){
                            window.location.href = '/logout';
                            $('input[name=uid]').val(" ");
                            $('input[name=path]').val(" ");
                            if ($uid != "")
                                window.socket.emit("logout", $uid);
                            layer.close(index)
                        });
                })
            })
        }
        ,xySlider: function()
        {
            // 大图轮播
            var $slider = $(".js_idxSlider"), $nav = $(".slider-nav i");
            $slider.jq_xySlider({
                effect: "fade",
                autoplay:true,
                delay: 5000,
                onEnd: function(idx){
                    $nav.removeClass("on").eq(idx).addClass("on");
                },
                navigation: $nav
            });
        }
        ,Dropdown: function()
        {
            $(".J__dropdown").hover(function(){
				$(this).addClass("active").siblings().removeClass("on");
				$(this).find(".dropdownMenu2").stop(true).slideDown(200);
			}, function(){
				$(this).removeClass("active");
				$(".J__navMenu .current").addClass("on");
				$(this).find(".dropdownMenu2").stop(true).hide();
			});
        }
        ,NavMenu: function()
        {
            $(".J__navMenu li:not('.u-info')").hover(function(){
				$(this).addClass("on").siblings().removeClass("on");
			}, function(){
				$(this).removeClass("on");
				$(".J__navMenu .current").addClass("on");
			});
        }
        ,PlaySoundHandler: function()
        {
            ssc.PlaySound('/Resourse/Home/audio/call.wav')
        }
        ,PlaySound: function(src)
        {
            if("\v"=="v")
            { 
                $('#newMessageDIV').html('<embed id="play1" src="'+src+'"/>'); 
            }
            else
            {
                $('#newMessageDIV').html('<audio id="play1" autoplay="autoplay"><source src="'+src+'"'+ 'type="audio/wav"/></audio>');
            }
        }
        ,displayPanl: function()
        {
            $.post("/DisplayBuy/timeDown",{"lid":$lid},function(data){
                display.html(tpl("#display_tpl",{rows:[data]})),ssc.runIt(data['last_number'])
                /* todo 显示最近5期开奖 */
                ssc.LotteryRecord()
                r.bonus = [data['bonus']]
                r.currentid = data['id']
                r.selectItem[0].lid = data['lid']
                r.selectItem[0].currentid = data['id']
                r.selectItem[0].bonusLevel = data['bonuslevel']
                r.selectItem[0].bdw_ret_point = data['bdw_ret_point']
                var endtime = data['endtime'];
                $("#current_endtime").html(endtime);
                $("#bottomSearis").html(data.series_number)
                ssc.setSelectItemHeighPrize()
                ssc.getBuyRecordItem()
                ssc.getBuyAddRecordItem()
                ssc.gamem({bonus: r.bonus,bonuslevel: r.selectItem[0].bonusLevel},r.selectItem[0].playname)

                var stoptimeArr = data['endtime'].split(" ")
                var stopTime1 = stoptimeArr[0].split("-")
                var stopTime2 = stoptimeArr[1].split(":")
                var stop = new Date(stopTime1[0],stopTime1[1],stopTime1[2],stopTime2[0],stopTime2[1],stopTime2[2])

                var serverTimeArr = data['servertime'].split(" ")
                var serverTime1 = serverTimeArr[0].split("-")
                var serverTime2 = serverTimeArr[1].split(":")
                var ServerDate = new Date(serverTime1[0],serverTime1[1],serverTime1[2],serverTime2[0],serverTime2[1],serverTime2[2])
                var now = new Date()
                var ClientDate= new Date(now.getFullYear(),now.getMonth()+1,now.getDate(),now.getHours(),now.getMinutes(),now.getSeconds())
                // 本地时间与服务器的时间差
                var d = ClientDate.getTime()-ServerDate.getTime()
                $("input[name='d']").val(d);
                clock();
            },'json')
            
            function clock(){
                var today = new Date();
                var d = $("input[name='d']").val();
                today.setTime(today.getTime()-d);
                var nowtoday = new Date(today.getFullYear(),today.getMonth()+1,today.getDate(),today.getHours(),today.getMinutes(),today.getSeconds());
                var stoptime = $("#current_endtime").html();
                var stoptimeArr = stoptime.split(" ");
                var stopTime1 = stoptimeArr[0].split("-");
                var stopTime2 = stoptimeArr[1].split(":");
                var stop = new Date(stopTime1[0],stopTime1[1],stopTime1[2],stopTime2[0],stopTime2[1],stopTime2[2]);
                var leave=stop-nowtoday;
                if(leave>=1000){
                    var timestamp = leave/1000;
                    var second = Math.floor( timestamp % 60);
                    var minute = Math.floor((timestamp / 60)	% 60);
                    var hour   = Math.floor((timestamp / 3600)	% 24);
                    var day    = Math.floor((timestamp / 3600)	/ 24);
                    var h = ('0'+hour).slice(-2);
                    var m = ("0"+minute).slice(-2);
                    var s = ("0"+second).slice(-2);
                    $("#count_down").html('<i>'+ h+'</i><i>'+ m+'</i><i>'+ s+'</i>');
                    $("#bottomTime").html(h+":"+m+":"+s)
                    setTimeout(clock, 1000);
                } else {
                    if($("li",cartlist).length>1)
                    {
                        $.dialog.close('*')
                        layui.use('layer', function(layer){
                            var index = layer.confirm('购物车还有未提交的数据,是否清除？', {
                                btn: ['确定清除','保留购买'] 
                                ,anim:3
                                ,btnAlign: 'c'
                                }, function(){
                                    ssc.cleanCartlist()
                                    layer.close(index)
                                });
                        })
                    }
                    else
                    {
                        $.dialog.close('*');
                        alertify.success("<div class='text'><i class='ico-success'></i>该期已结束，进入下期购买，请留意期号变化<i class='suc-close'></i></div>")
                    }
                    ssc.delAddperiodsItem()
                    ssc.displayPanl();
                }
            }
        }
        ,runIt: function(num)
        {
            var numarr = num.split(',')
            for(var i=0; i<numarr.length; i++)
            {
                $("#num"+i).text(numarr[i])
            }
        }
        ,socketEvent: function()
        {
            $event="";
            switch (parseInt($lid))
            {
                case 5:
                    $event = "jsxwOpenCode";
                    break;
                case 6:
                    $event = "jxxwOpenCode";
                    break;
                case 7:
                    $event = "gdxwOpenCode";
                    break;
                case 8:
                    $event = "sdxwOpenCode";
                    break;
                case 24:
                    $event = "sxxwOpenCode";
                    break;
                case 25:
                    $event = "ssxxwOpenCode";
                    break;
            }
            window.socket.on($event,function(data)
            {
                $json = JSON.parse(data);
                $("#lastSeries").text($json.series_number);
                ssc.runIt($json.number)
                var _recentHtml = '<tr><td>'+$json.series_number+'</td><td><div class="number">'
                var $numarray = $json.number.split(",")
                for(var j=0; j<$numarray.length; j++)
                {
                    _recentHtml += '<i>'+$numarray[j]+'</i>';
                }
                _recentHtml += '</div></td></tr>';
                $("#game_jwuqi>tbody").find("tr:last").remove()
                $("#game_jwuqi>tbody").find("tr:first").before(_recentHtml);
                ssc.getBuyRecordItem()
                ssc.getBuyAddRecordItem()
            })
            window.socket.on("message", function($data) {
                var $json = $data.split('-')
                if ($json[1] == 1) {
                    ssc.getBuyRecordItem()
                    ssc.getBuyAddRecordItem()
                }
            })
        }
        ,getBuyRecordItem: function()
        {
            $.post("/buyRecordItem",{"lid":$lid},function(data){
                $("#buyrecorditem").html(tpl("#buyrecord_tpl",{rows:[data]}))
                $("a[data-method=detail]").on("click",function(){
                    $buyid = $(this).attr("data-field");
                    $.dialog.open({
                        title: '订单详情',
                        width: 800,
                        height:590,
                        btnText:["关 闭"],
                        type: 'alert'
                    }).ready(function(o) {
                        $.post('/selfRecordDetail',{"id":$buyid},function(json){
                            if(json.length==0) return false;
                            o.html(tpl('#detail_record',{rows:[json]}))
                        },'json')
                    })
                })
                $("a[data-method=cancel]").on("click",function(e){
                    var $item = $(e.target).closest('tr')
                    $buyid = $(this).attr("data-field");
                    $.post("/recordCancel",{"id":$buyid},function(msg){
                        if(msg==true)
                        {
                            $item.find("td:eq(4)").html('<span style="color:red">已撤单</span>');
                            $(e.target).remove();
                            alertify.success("<div class='text'><i class='ico-success'></i>订单取消成功<i class='suc-close'></i></div>")
                            ssc.getMoney()
                        }
                        else
                        {
                            $.dialog.close("*")
                            alertify.error("<div class='text'><i class='ico-error'></i>订单取消失败<i class='err-close'></i></div>")
                        }
                        return;
                    },'text')
                })
            },'json')
        }
        ,getBuyAddRecordItem: function()
        {
            $.post("/buyAddRecordItem",{"lid":$lid},function(data){
                $("#buyrecordadditem").html(tpl("#buyaddrecord_tpl",{rows:[data]}))
                $("a[data-method=adddetail]").on("click",function(){
                    $buyid = $(this).attr("data-field");
                    $.dialog.open({
                        title: '追号订单',
                        width: 900,
                        height:580,
                        btnText:["关 闭"],
                        type: 'alert'
                    }).ready(function(o) {
                        $.post('/selfaddRecordDetail',{"id":$buyid},function(json){
                            if(json.length==0) return false;
                            o.html(tpl('#detail_add_record',{rows:[json]}))
                        },'json')
                    })
                })
                $("a[data-method='list']").on("click",function(){
                    $buyid = $(this).attr("data-field");
                    $.dialog.open({
                        title: '追号列表',
                        width: 1000,
                        height:450,
                        btnText:["全部撤单","关闭"],
                        type: 'confirm'
                    }).ready(function(o) {
                        var index = layer.load(2, {shade: [0.8, '#393D49'],time:5000});
                        $.post('/addRecordList',{"id":$buyid},function(json){
                            if(json.length==0) return false;
                            o.html(tpl('#record_list',{rows:[json]}))
                            ssc.TrHover()
                            layer.close(index)
                            $("a[data-method='addcancel']").on("click",function(e){
                                var $item = $(e.target).closest('tr')
                                $addbuyid = $(this).attr("data-field");
                                $.post("/addrecordCancel",{"id":$addbuyid},function(msg){
                                    if(msg==true)
                                    {
                                        alertify.success("<div class='text'><i class='ico-success'></i>订单取消成功<i class='suc-close'></i></div>")
                                        $item.find("td:eq(8)").html('<span style="color:red">已撤单</span>');
                                        $item.find("td:eq(9)").html('无操作');
                                        setTimeout(ssc.getMoney,2000)
                                    }
                                    else
                                    {
                                        alertify.error("<div class='text'><i class='ico-error'></i>订单取消失败<i class='err-close'></i></div>")
                                    }
                                },'text')
                            })
                            $addbuyid = $("a[data-method='addcancel']:eq(0)").attr("data-field");
                            if($.cookie("allcancelno"+$addbuyid)==1)
                            {
                                $('button[data-method="allCancel"]').remove()
                                return false
                            }
                            $('button[data-method="allCancel"]').on('click', function(){
                                if(typeof($addbuyid)=="undefined"){
                                    $.cookie("allcancelno"+$addbuyid, 1)
                                    $.dialog.close("*")
                                    alertify.error("<div class='text'><i class='ico-error'></i>订单已全部撤单<i class='err-close'></i></div>")
                                    return false;
                                }
                                else
                                {
                                    $.post("/allrecordCancel",{"id":$addbuyid},function(msg){
                                        if(msg==true)
                                        {
                                            $.cookie("allcancelno"+$addbuyid, 1)
                                            $.dialog.close("*")
                                            alertify.success("<div class='text'><i class='ico-success'></i>追号订单批量撤单处理中<i class='suc-close'></i></div>")
                                            setTimeout(ssc.getMoney,10000)
                                        }
                                        else
                                        {
                                            $.dialog.close("*")
                                            alertify.error("<div class='text'><i class='ico-error'></i>追号订单批量撤单失败<i class='err-close'></i></div>")
                                        }
                                    },'text')
                                    $.dialog.close('*');
                                    return false;
                                }
                            })
                        },'json')
                    })
                })
            },'json')
        }
        ,gamea: function(a)
        {
            gamec.html(tpl("#search_tpl", a))
        }
        ,gamet: function(a)
        {
            gamen.html(tpl("#bet_tpl", a))
            howtoplay.html(tpl("#howtoplay_tpl", a))
            ssc.PopHelp()
        }
        ,gamem: function(a,n)
        {
            $n = String(n);
            if (typeof(a['bonus']) == "undefined") return;
            if ($n == "定单双") {
                var _html = '<option value="1">动态奖金' + '-' + a['bonuslevel'] + '%</option>';
            } else {
                var _html = '<option value="1">奖金' + a['bonus'][0]['common'][$n] + '-' + a['bonuslevel'] + '%</option>';
                _html += '<option selected value="2">奖金' + a['bonus'][0]['change'][$n] + '-0%</option>';
            }
            prize.html(_html);
        }
        ,t_oninput: function(p)
        {
            if(String(p).indexOf("单式")>0 || String(p).indexOf("混合组选")>0)
            {
                var element = document.getElementById("lt_write_box");
                if("\v"=="v")
                {
                    element.onpropertychange = function()
                    {
                        var s = element.value;
                        s = s.replace(/[^\d\s,]/g,",");
                        element.value = s;
                        s = s.replace(/(^\s*)|(\s*$)/g,"")
                        var a = (s!="") ? s.split(",") : "";

                        $result = ssc.checkUnitaryMate(a);
                        if($result['result']!="")
                            a = $result['result'].split(",");
                        else
                            a = []
                        ssc.calculateCommonUnitary(a.length)
                        ssc.setSingerSelectItemNumber($result['result'])
                    }
                }
                else
                {
                    element.addEventListener("input",function(){
                        var s = element.value;
                        s = s.replace(/[^\d\s,]/g,",");
                        element.value = s;
                        s = s.replace(/(^\s*)|(\s*$)/g,"")
                        var a = (s!="") ? s.split(",") : "";

                        $result = ssc.checkUnitaryMate(a);
                        if($result['result']!="")
                            a = $result['result'].split(",");
                        else
                            a = []
                        ssc.calculateCommonUnitary(a.length)
                        ssc.setSingerSelectItemNumber($result['result'])
                    },false);
                }
            }
        }
        ,checkUnitaryMate: function(a)
        {
            $fn = $("#lt_write_box").attr("data-method")
            $filter = $("#lt_write_box").attr("data-fn")
            $limit = $("#lt_write_box").attr('data-field')
            $result = SetFilterFunc($fn,a,$limit,$filter);
            return $result;
        }
        ,emptyText: function()
        {
            $("a[data-method=empty-text]").on("click",function(){
                var element = document.getElementById("lt_write_box");
                element.value = "";
                $n = r.selectItem[0]['playname']
                a = ""
                ssc.calculateCommonUnitary(a.length)
                ssc.setSingerSelectItemNumber("")
            })
        }
        ,filterData: function()
        {
            $("a[data-method=filter-data]").on("click",function(){
                var element = document.getElementById("lt_write_box");
                var s = element.value;
                s = s.replace(/[;]/g,",")
                s = s.replace(/(^\s*)|(\s*$)/g,"")
                var a = (s!="") ? s.split(",") : "";
                if(a!="")
                {
                    res = window.filterArray(a);
                    result = res['result'];
                    filter = res['filter'];

                    if(result=="") return false;
                    element.value = result.join(" ")
                    s = element.value;
                    var a = (s!="") ? s.split(" ") : "";
                    p = $('.selected',"#game_search").attr("data-field");
                    ssc.calculateCommonUnitary(a.length)
                    ssc.setSingerSelectItemNumber(result.join(" "))
                    if(filter.length>0)
                    {
                        $data = filter.join(" ")
                        $.dialog.open({
                            title: '过滤的数据',
                            width: 600,
                            btnText:['关闭'],
                            type: 'alert'
                        }).ready(function(o) {
                            o.html(tpl('#filternumber_tpl',{rows:$data}))
                        }).confirm(function() {
                            $.dialog.close("*")
                            return false
                        })
                    }
                }
                else
                {
                    return false;
                }
            })
        }
        ,importFile: function()
        {
            $('a[data-method=import-file]').on('click',function(){
                layui.use('layer', function(layer){
                    var index = layer.confirm('<div style="text-align:center"><a href="javascript:;" class="a-upload"><input type="file" name="" id="file"><s class="fa fa-file"></s>上传文件txt文件</a></div>', {
                        title:'导入号码'
                        ,btn: ['导入号码','关闭'] 
                        ,anim:3
                        ,btnAlign: 'c'
                        }, function(){
                            if(typeof FileReader == 'undefined') {
                                return false;
                            }
                            var simpleFile = document.getElementById("file").files[0];
                            var reader = new FileReader();
                            // 将文件以文本形式读入页面中
                            reader.readAsText(simpleFile);
                            reader.onload = function(e){
                                var element = document.getElementById("lt_write_box");
                                result = this.result.replace(/[^\d\s]/g,",").replace(/(^\s*)|(\s*$)/g,"")
                                element.value = result
                                s = result;
                                var a = (s!="") ? s.split(" ") : "";
                                $result = ssc.checkUnitaryMate(a);
                                if($result['result']!="")
                                    a = $result['result'].split(" ");
                                else
                                    a = []
                                p = $('.selected',"#game_search").attr("data-field");
                                ssc.calculateCommonUnitary(a.length)
                                ssc.setSingerSelectItemNumber($result['result'])
                            }
                            layer.close(index)
                        });
                })
            })
        }
        ,cleanCartlist: function()
        {
            $("li",cartlist).remove()
            ssc.calculateCartlist();
        }
        ,addCartlist: function()
        {
            if(ssc.isInsite())
            {
                order = ssc.setOrderTempData()
                id = r.orderItem.length
                selnum = r.selectItem[0].selectNumber
                switch(parseInt(r.selectItem[0].model))
                {
                    case 0:
                        $model = '元模式';break;
                    case 1:
                        $model = '角模式';break;
                    case 2:
                        $model = '分模式';break;
                    case 3:
                        $model = '厘模式';break;
                }

                showselnum = (selnum.length>10) ? (selnum.substr(0,50)+'...') : selnum
                var _html = '<li>'
                _html += '<em>'+r.selectItem[0].play+'_'+r.selectItem[0].showplayname+'</em>'
                _html += '<em>'+r.selectItem[0].multiple+'倍</em>'
                _html += '<em>'+$model+'</em>'
                _html += '<em>'+showselnum+'</em>'
                _html += '<em>'+r.selectItem[0].singermoney+'</em>'
                _html += '<em><a href="javascript:;" data-field="'+id+'" title="删除订单" data-method="delete"><img src="/Resourse/Home/images/cp/icon_del-num.png" /></a></em></li>'
                $("#cartlist").append(_html)
                r.orderItem.push(order)
                ssc.cleanSelectItemData()
                ssc.calculateCartlist()
            }
            else
            {
                return false;
            }
        }
        ,isInsite: function()
        {
            if(r.selectItem[0].selectNumber=="" || r.selectItem[0].singermoney==0 || r.selectItem[0].singernote==0)
            {
                return false
            }
            else
            {
                return true
            }
        }
        ,setOrderTempData: function()
        {
            order = new Object()
            order.bonusLevel = r.selectItem[0].bonusLevel
            order.currentid = r.selectItem[0].currentid
            order.lid = r.selectItem[0].lid
            order.model = r.selectItem[0].model
            order.multiple = r.selectItem[0].multiple
            order.playname = r.selectItem[0].playname
            order.position = r.selectItem[0].position
            order.prize = r.selectItem[0].prize
            order.selectNumber = r.selectItem[0].selectNumber
            order.singermoney = r.selectItem[0].singermoney
            order.singernote = r.selectItem[0].singernote
            return order
        }
        ,cleanSelectItemData: function()
        {
            r.selectItem[0].selectNumber=""
            r.selectItem[0].singermoney=0
            r.selectItem[0].singernote=0
        }
        ,calculateCartlist: function()
        {
            var orderCount = 0;
            var orderMoney = 0;
            $("li",cartlist).each(function(i){
                orderCount = i+1;
                $m = $("em:eq(4)",this).text();
                orderMoney = orderMoney + parseFloat($m);
            })
            $("#orderCount").text(orderCount);
            $("#orderMoney").text(orderMoney);
            ssc.addCartlistAfterHandler()
        }
        ,addCartlistAfterHandler: function()
        {
            $n = r.selectItem[0]['playname']
            if(String($n).indexOf("单式")>0  || String($n).indexOf("混合组选")>0)
            {
                var element = document.getElementById("lt_write_box");
                element.value = "";
            }
            $("#J__selNums li").find(".lottery-ball").removeClass("on")
            $("#singernote").text(0)
            $("#singermoney").text(0)
        }
        ,calculateCommonUnitary: function(note)
        {
            var multiple = $("input[name=multiple]").val();
            var m;
            $("#J__selUnit").find('i').each(function(){
                if($(this).hasClass('on'))
                    m = $(this).attr('data-field')
            })
            switch (parseInt(m))
            {
                case 0:
                    $currentmoney = note*multiple*2
                    break
                case 1:
                    $currentmoney = note*multiple*2/10
                    break
                case 2:
                    $currentmoney = note*multiple*2/100
                    break
                case 3:
                    $currentmoney = note*multiple*2/1000
                    break
            }
            $("#singernote").text(note)
            $("#singermoney").text($currentmoney)
            r.selectItem[0].model = m
            r.selectItem[0].multiple = multiple
            r.selectItem[0].singernote = note
            r.selectItem[0].singermoney = $currentmoney
        }
        ,setSingerSelectItemNumber: function(number)
        {
            r.selectItem[0].selectNumber = number
        }
        ,setSelectItemHeighPrize: function()
        {
            playname = r.selectItem[0].playname
            if(playname.indexOf("定单双")==-1)
                r.selectItem[0].prize = r.bonus[0]['change'][playname]+"|0|2"
            else
                r.selectItem[0].prize = "动态奖金|0|2"
        }
        ,setSelectItemLowPrize: function()
        {
            playname = r.selectItem[0].playname
            if(playname.indexOf("不定位")==-1)
            {
                if(playname.indexOf("定单双")==-1)
                {
                    r.selectItem[0].prize = r.bonus[0]['common'][playname]+"|"+ r.selectItem[0].bonusLevel + "|1"
                }
                else
                {
                    r.selectItem[0].prize = "动态奖金|"+ r.selectItem[0].bonusLevel + "|1"
                }
            }  
            else
                r.selectItem[0].prize = r.bonus[0]['common'][playname]+"|"+ r.selectItem[0].bdw_ret_point + "|1"
        }
        ,mutiplechange: function()
        {
            var $mode;
            $singermoneyval = $("#singermoney")
            $("#J__selUnit").find('i').each(function(){
                if($(this).hasClass('on'))
                    $mode = $(this).attr('data-field')
            })
            $singernoteval = parseInt($("#singernote").text())
            $multipleval = parseInt($("input[name=multiple]").val())
            switch (parseInt($mode))
            {
                case 0:
                    $mulCurrentMoney = $singernoteval*$multipleval*2
                    break;
                case 1:
                    $mulCurrentMoney = $singernoteval*$multipleval*2/10
                    break;
                case 2:
                    $mulCurrentMoney = $singernoteval*$multipleval*2/100
                    break;
                case 3:
                    $mulCurrentMoney = $singernoteval*$multipleval*2/1000
                    break;
            }
            $singermoneyval.text($mulCurrentMoney)
            r.selectItem[0].multiple = $multipleval
            r.selectItem[0].singermoney = $mulCurrentMoney
        }
        ,init: function(data)
        {
            r.selectItem[0].playname = data.playname
            r.selectItem[0].showplayname = data.showplayname.replace(/(^\s*)|(\s*$)/g,"")
            r.selectItem[0].multiple = 1
            r.selectItem[0].model = 0
            r.selectItem[0].singernote = 0
            r.selectItem[0].singermoney = 0
            r.selectItem[0].selectNumber = ""
            if(typeof(r.bonus) != "undefined" )
            {
                ssc.setSelectItemHeighPrize()
            }
            $("#singernote").text(0)
            $("#singermoney").text(0)
            r.addItem=[]
        }
        ,initSetDefaultOption: function($id)
        {
            r.selectItem[0].position = ""
            $tabs = r.tabs
            $name = ""
            $tabs.forEach(function($item){
                if($item.id==$id)
                {
                    $name = $item.name
                }
            })
            r.selectItem[0].play = $name
            ssc.init({"playname": r.search[$id][0].games[0].alias,"showplayname":r.search[$id][0].games[0].name})
        }
        ,getSeparator: function()
        {
            return " "
        }
        ,selectNumbe: function()
        {
            n = $('li','#J__selNums').length
            $select = new Array()
            $play = r.selectItem[0].play
            $playname = r.selectItem[0].playname

            // 返回分隔符
            $separator = ssc.getSeparator()
            $selectNumber = ''
            for(i=1; i<=n; i++)
            {
                $num = ""
                $("#J__selNums li:eq("+(i-1)+")").find(".lottery-ball").each(function(){
                    if($(this).hasClass("on"))
                    {
                        $num += $(this).attr("data-val")+$separator
                    }
                })
                if($separator==" ")
                    $num = $num.substring(0,$num.length-1)
                $selectNumber += $num + ","
            }
            $selectNumber = $selectNumber.substr(0,$selectNumber.length-1)
            r.selectItem[0].selectNumber = $selectNumber
            for(i=1; i<=n; i++)
            {
                $temp = new Array();
                $count = $("#J__selNums li:eq("+(i-1)+")").find(".on").length
                $select.push($count)
            }
            window.select = $select;
            window.selectRowsNumber = $selectNumber
        }
        ,calculateMultipleNote: function()
        {
            ssc.selectNumbe();
            p = $('.selected',"#game_search").attr("data-field");
            $func = ["前二直选复式", "后二直选复式", "前三直选复式", "后三直选复式", "后三直选单式", "定位胆"]
            $referenceFunc = new Object()
            $referenceFunc = '{' +
                '"前二组选复式":"q2zxfs",' +
                '"前二组选胆拖":"q2zxdt",' +
                '"后二组选复式":"q2zxfs",' +
                '"后二组选胆拖":"q2zxdt",' +
                '"前三组选复式":"q3zxfs",' +
                '"前三组选胆拖":"q3zxdt",' +
                '"后三组选复式":"q3zxfs",' +
                '"后三组选胆拖":"q3zxdt",' +
                '"前三一码不定位":"q31mbdw",' +
                '"后三一码不定位":"q31mbdw",' +
                '"定单双":"dds",' +
                '"任选一":"rx1",' +
                '"任选二":"rx2",' +
                '"任选三":"rx3",' +
                '"任选四":"rx4",' +
                '"任选五":"rx5",' +
                '"任选六":"rx6",' +
                '"任选七":"rx7",' +
                '"任选八":"rx8",' +
                '"任选二胆拖":"rx2dt",' +
                '"任选三胆拖":"rx3dt",' +
                '"任选四胆拖":"rx4dt",' +
                '"任选五胆拖":"rx5dt",' +
                '"任选六胆拖":"rx6dt",' +
                '"任选七胆拖":"rx7dt",' +
                '"任选八胆拖":"rx8dt"}'
            $referenceArrFunc = JSON.parse($referenceFunc)
            if(jQuery.inArray(p,$func)!=-1)
            {
                $note = ssc.ElectionsPenthouse()
            }
            else
            {
                $note = ssc.setCalculateFuncHandler($referenceArrFunc[p])
            }
            ssc.calculateCommonUnitary($note)
        }
        ,ElectionsPenthouse: function()
        {
            $selectRowsNumber = window.selectRowsNumber
            $rowsNumber = $selectRowsNumber.split(",")
            $len = $rowsNumber.length
            $z = 0
            n = $('li','#J__selNums').length
            if(n==2 && $rowsNumber.length==2)
            {
                $first = $rowsNumber[0].split(" ")
                $second = $rowsNumber[1].split(" ")
                if($first[0]!="" && $second[0]!="")
                {
                    for (var i = 0; i < $first.length; i++) {
                        for (var j = 0; j < $second.length; j++) {
                            if ($first[i] == $second[j]) {
                                continue;
                            } else {
                                $z++;
                            }
                        }
                    }
                }
                return $z
            }
            if(n==3 && $rowsNumber.length==3)
            {
                $first = $rowsNumber[0].split(" ")
                $second = $rowsNumber[1].split(" ")
                $three = $rowsNumber[2].split(" ")
                if($first[0]!="" && $second[0]!="" && $three[0]!="")
                {
                    for (var i = 0; i < $first.length; i++) {
                        for (var j = 0; j < $second.length; j++) {
                            for (var k = 0; k < $three.length; k++) {
                                if ($first[i] == $second[j] || $second[j] == $three[k] || $first[i] == $three[k]) {
                                    continue;
                                } else {
                                    $z++;
                                }
                            }
                        }
                    }
                }
                return $z
            }
            if(n==5 && $rowsNumber.length==5)
            {
                for(var i=0; i<$rowsNumber.length; i++)
                {
                    if($rowsNumber[i]!="")
                        $z += $rowsNumber[i].split(" ").length
                }
                return $z
            }
        }
        ,setCalculateFuncHandler: function(func)
        {
            return window[func]()
        }
        ,RndNum: function(n)
        {
            var rnd="";
            for(var i=0;i<n;i++)
                rnd+=Math.floor(Math.random()*10);
            return rnd;
        }
        ,checkSubmit: function()
        {
            if(r.selectItem[0].playname=="" || r.selectItem[0].selectNumber=="" || r.selectItem[0].singernote==0
                || r.selectItem[0].singermoney==0 || r.selectItem[0].model=="" || r.selectItem[0].prize=="" || parseInt(r.selectItem[0].multiple)<1
                || r.currentid=="" || r.selectItem[0].lid=="" || r.selectItem[0].singermoney==0)
            {
                return false
            }
                else
            {
                return true
            }
        }
        ,delAddperiodsItem: function()
        {
            $(".t1_addItemList").find("tr:gt(0)").each(function(){
                if(parseInt($(this).attr("id")) == r.selectItem[0].currentid)
                {
                    $(this).remove()
                }
            })
            $o = $('select[name=addPeriods]').find("option:eq(5)").val()
            $('select[name=addPeriods]').find("option:eq(5)").val(parseInt($o)-1)
            $(".totalPeriods").text(parseInt($o)-1)
            ssc.calculateAddListItem()
        }
        ,addperiodsChange: function()
        {
            $("select[name='addPeriods']").on("change",function(){
                type=""
                $("#menu0").find("li").each(function(){
                    if($(this).hasClass("hover"))
                    {
                        type = $(this).attr("aria-controls")
                    }
                })
                $i = $(this).val()
                $("input[name="+type+"_addPeriodsInput]").val($i)
            })
        }
        ,createWithTimes: function(type)
        {
            $addPeriodsInput = parseInt($('input[name='+type+'_addPeriodsInput]').val())
            $startBate = parseInt($('input[name='+type+'_startBate]').val())
            $("."+type+"_addItemList").find("tr:gt(0)").each(function(i){
                if(i<$addPeriodsInput)
                {
                    $(this).find("td:eq(0)").find("input").removeAttr("disabled")
                    $(this).find("td:eq(2)").find("input").removeAttr("disabled")
                    $singernoteval = parseInt(r.orderItem[0].singernote)
                    switch (parseInt(r.orderItem[0].model))
                    {
                        case 0:
                            $m = $startBate*$singernoteval*2
                            break;
                        case 1:
                            $m = $startBate*$singernoteval*2/10
                            break;
                        case 2:
                            $m = $startBate*$singernoteval*2/100
                            break;
                        case 3:
                            $m = $startBate*$singernoteval*2/1000
                            break;
                    }
                    $(this).find("td:eq(0)").find("input").prop("checked",true)
                    $(this).find("td:eq(2)").find('input').val($startBate)
                    $(this).find("td:eq(3)").text($m)

                    $(this).find("td:eq(2)").find("input").on("blur",function(e){
                        var $item = $(e.target).closest('tr')
                        $singernoteval = parseInt(r.orderItem[0].singernote)
                        $chidldstartBate = $(this).val()
                        switch (parseInt(r.orderItem[0].model))
                        {
                            case 0:
                                $cm = $chidldstartBate*$singernoteval*2
                                break;
                            case 1:
                                $cm = $chidldstartBate*$singernoteval*2/10
                                break;
                            case 2:
                                $cm = $chidldstartBate*$singernoteval*2/100
                                break;
                            case 3:
                                $cm = $chidldstartBate*$singernoteval*2/1000
                                break;
                        }
                        $item.find("td:eq(3)").text($cm)
                        ssc.calculateAddListItem()
                    })
                    $(this).find("td:eq(0)").find("input").on('click',function(){
                        ssc.calculateAddListItem()
                    })
                }
                else
                {
                    $(this).find("td:eq(0)").find("input").attr("disabled","disabled")
                    $(this).find("td:eq(0)").find("input").prop("checked",false)
                    $(this).find("td:eq(2)").find("input").attr("disabled","disabled")
                    $(this).find("td:eq(2)").find("input").val(1)
                }
            })
        }
        ,createDouble: function(type)
        {
            $addPeriodsInput = parseInt($('input[name='+type+'_addPeriodsInput]').val())
            $startBate = parseInt($('input[name='+type+'_startBate]').val())
            $("."+type+"_addItemList").find("tr:gt(0)").each(function(i){
                if(i<$addPeriodsInput)
                {
                    $(this).find("td:eq(0)").find("input").removeAttr("disabled")
                    $(this).find("td:eq(2)").find("input").removeAttr("disabled")
                    j = i-1;
                    if(j<0)
                    {
                        $doublebatechild = 1;
                        $(this).find("td:eq(2)").find("input").val($doublebatechild);
                    }
                    else
                    {
                        var n = $("."+type+"_addItemList").find("tr:eq("+(j+1)+")").find("td:eq(2)").find("input").val()
                        $doublebatechild = $startBate*n
                        $(this).find("td:eq(2)").find("input").val($doublebatechild);
                    }
                    $doublebate = parseInt($(this).find("td:eq(2)").find("input").val())
                    $singernoteval = parseInt(r.orderItem[0].singernote)
                    switch (parseInt(r.orderItem[0].model))
                    {
                        case 0:
                            $m = $doublebate*$singernoteval*2
                            break;
                        case 1:
                            $m = $doublebate*$singernoteval*2/10
                            break;
                        case 2:
                            $m = $doublebate*$singernoteval*2/100
                            break;
                        case 3:
                            $m = $doublebate*$singernoteval*2/1000
                            break;
                    }
                    $(this).find("td:eq(0)").find("input").prop("checked",true)
                    $(this).find("td:eq(3)").text($m)

                    $(this).find("td:eq(2)").find("input").on("blur",function(e){
                        var $item = $(e.target).closest('tr')
                        $singernoteval = parseInt(r.orderItem[0].singernote)
                        $chidldstartBate = $(this).val()
                        switch (parseInt(r.orderItem[0].model))
                        {
                            case 0:
                                $cm = $chidldstartBate*$singernoteval*2
                                break;
                            case 1:
                                $cm = $chidldstartBate*$singernoteval*2/10
                                break;
                            case 2:
                                $cm = $chidldstartBate*$singernoteval*2/100
                                break;
                            case 3:
                                $cm = $chidldstartBate*$singernoteval*2/1000
                                break;
                        }
                        $item.find("td:eq(3)").text($cm)
                        ssc.calculateAddListItem()
                    })
                    $(this).find("td:eq(0)").find("input").on('click',function(){
                        ssc.calculateAddListItem()
                    })
                }
                else
                {
                    $(this).find("td:eq(0)").find("input").attr("disabled","disabled")
                    $(this).find("td:eq(0)").find("input").prop("checked",false)
                    $(this).find("td:eq(2)").find("input").attr("disabled","disabled")
                    $(this).find("td:eq(2)").find("input").val(1)
                }
            })
        }
        ,mathcount: function(i)
        {
             var count=0;
            $(".t3_addItemList").find("tr:gt(0)").each(function(j){
                if(j<i){
                    var b = $(this).find("td:eq(2)").find("input").val();
                    count += parseInt(b);
                }
            });
            return count;
        }
        ,createProfit: function(type)
        {
            $addPeriodsInput = parseInt($('input[name='+type+'_addPeriodsInput]').val())
            $startBate = parseInt($('input[name='+type+'_startBate]').val())
            $profit = parseInt($('input[name=profit]').val())
            selectModel = r.orderItem[0].model
            MArray = r.orderItem[0].prize.split("|")[0]
            tzmoney = r.orderItem[0].singermoney
            Q =$profit/100
            if(selectModel == 0){
                MArray = MArray;
            } else if(selectModel == 1){
                MArray = MArray/10;
            } else if(selectModel == 2) {
                MArray = MArray/100;
            } else if(selectModel == 3) {
                MArray = MArray/1000;
            }
            $("."+type+"_addItemList").find("tr:gt(0)").each(function(i){
                if(i<$addPeriodsInput)
                {
                    $(this).find("td:eq(0)").find("input").removeAttr("disabled")
                    $(this).find("td:eq(2)").find("input").removeAttr("disabled")
                    $(this).find("td:eq(2)").find("input").val(1)
                    var n = $(this).find("td:eq(2)").find("input").val()
                    if(i==0)
                    {
                        $(this).find("td:eq(2)").find("input").val(n*$startBate);
                    }
                    else
                    {
                        var B = ssc.mathcount(i);
                        var m = B*tzmoney*(1+Q)/(MArray-tzmoney-tzmoney*Q);
                        m = Math.ceil(m);
                        if(m<=0)
                        {
                            alertify.error("<div class='text'><i class='ico-error'></i>达不到设置的利润率收益<i class='err-close'></i></div>")
                            $(this).find("td:eq(0)").find("input").attr("disabled","disabled")
                            $(this).find("td:eq(0)").find("input").prop("checked",false)
                            $(this).find("td:eq(2)").find("input").attr("disabled","disabled")
                            $(this).find("td:eq(2)").find("input").val(1)
                            $("."+type+"_addItemList").find("tr:eq(1)").find("td:eq(0)").find("input").attr("disabled","disabled")
                            $("."+type+"_addItemList").find("tr:eq(1)").find("td:eq(0)").find("input").prop("checked",false)
                            $("."+type+"_addItemList").find("tr:eq(1)").find("td:eq(2)").find("input").attr("disabled","disabled")
                            $("."+type+"_addItemList").find("tr:eq(1)").find("td:eq(2)").find("input").val(1)
                            $("."+type+"_addItemList").find("tr:eq(1)").find("td:eq(3)").html('0元')
                            return false
                        }
                        else
                        {
                            $(this).find("td:eq(2)").find("input").val(m);
                        }
                    }

                    $doublebate = parseInt($(this).find("td:eq(2)").find("input").val())
                    $singernoteval = parseInt(r.orderItem[0].singernote)
                    switch (parseInt(r.orderItem[0].model))
                    {
                        case 0:
                            $m = $doublebate*$singernoteval*2
                            break;
                        case 1:
                            $m = $doublebate*$singernoteval*2/10
                            break;
                        case 2:
                            $m = $doublebate*$singernoteval*2/100
                            break;
                        case 3:
                            $m = $doublebate*$singernoteval*2/1000
                            break;
                    }
                    $(this).find("td:eq(0)").find("input").prop("checked",true)
                    $(this).find("td:eq(3)").text($m)

                    $(this).find("td:eq(2)").find("input").on("blur",function(e){
                        var $item = $(e.target).closest('tr')
                        $singernoteval = parseInt(r.orderItem[0].singernote)
                        $chidldstartBate = $(this).val()
                        switch (parseInt(r.orderItem[0].model))
                        {
                            case 0:
                                $cm = $chidldstartBate*$singernoteval*2
                                break;
                            case 1:
                                $cm = $chidldstartBate*$singernoteval*2/10
                                break;
                            case 2:
                                $cm = $chidldstartBate*$singernoteval*2/100
                                break;
                            case 3:
                                $cm = $chidldstartBate*$singernoteval*2/1000
                                break;
                        }
                        $item.find("td:eq(3)").text($cm)
                        ssc.calculateAddListItem()
                    })
                    $(this).find("td:eq(0)").find("input").on('click',function(){
                        ssc.calculateAddListItem()
                    })
                }
                else
                {
                    $(this).find("td:eq(0)").find("input").attr("disabled","disabled")
                    $(this).find("td:eq(0)").find("input").prop("checked",false)
                    $(this).find("td:eq(2)").find("input").attr("disabled","disabled")
                    $(this).find("td:eq(2)").find("input").val(1)
                }
            })
        }
        ,calculateAddListItem: function()
        {
            type=""
            $("#menu0").find("li").each(function(){
                if($(this).hasClass("hover"))
                {
                    type = $(this).attr("aria-controls")
                }
            })
            var $totalMoney = 0
            r.addItem = []
            $("."+type+"_addItemList").find("tr:gt(0)").each(function(){
                if($(this).find("td:eq(0)").find("input").prop("checked")==true)
                {
                    $id = parseInt($(this).find("td:eq(0)").find("input").val())
                    $bet = parseInt($(this).find("td:eq(2)").find("input").val())
                    $amoney = parseFloat($(this).find("td:eq(3)").text())
                    $order = $id+":"+$bet+":"+parseFloat($amoney)
                    r.addItem.push($order)
                    $totalMoney += parseFloat($amoney*1000)
                }
            })
            $("."+type+"_addTotalMoney").text(parseFloat($totalMoney/1000))
        }
        ,addOrderSubmit: function()
        {
            $addItem = r.addItem
            $orderItem = r.orderItem
            if($addItem.length==0 || $orderItem.length==0) return;
            $totalMoney = 0;
            $data = ""
            $selectData = ""
            var t = new Date().getTime();
            var randkey = t + r.orderItem[0].lid + ssc.RndNum(6);
            randkey = "z*" + randkey + "*" + r.currentid + "*" + $("input[name=uid]").val();
            for(var o in $orderItem)
            {
                if($orderItem[o].playname=="" || $orderItem[o].selectNumber=="" || $orderItem[o].singernote==0
                    || $orderItem[o].singermoney==0 || $orderItem[o].model=="" || $orderItem[o].prize=="" || parseInt($orderItem[o].multiple)<1
                    || r.currentid=="" || $orderItem[o].lid=="" || $orderItem[o].singermoney==0)
                {

                }
                else
                {
                    $selectData = $orderItem[o].playname+":"+$orderItem[o].selectNumber+":"+$orderItem[o].singernote+
                        ":"+$orderItem[o].multiple+":"+$orderItem[o].singermoney+":"+$orderItem[o].model+":"+$orderItem[o].prize+":"+$orderItem[o].position
                    $lid = $orderItem[o].lid
                }
            }
            if($selectData=="") return
            $selectData = $selectData+"*"
            for(var i in $addItem)
            {
                $sp = $addItem[i].split(":")
                $totalMoney += parseFloat($sp[2]*1000)
                $selectData += $addItem[i] + "||"
            }
            $selectData = $selectData.substring(0, $selectData.length - 2);
            $totalMoney = parseFloat($totalMoney/1000)
            if ($("input[name='stop']").prop("checked") == true)
                var isStop = 1;
            else
                var isStop = 0;
            $data = "data="+$selectData+"&lottery_number_id="+r.currentid+"&is_add=1&lottery_id="+
                $lid+"&amount="+$totalMoney+"&isStop="+isStop+"&com="+randkey
            $.post("/Big",$data,function(info){
                if (info.status == 0 || info.status == "")
                {
                    $.dialog.close('*');
                    alertify.error("<div class='text'><i class='ico-error'></i>"+info.info+"<i class='err-close'></i></div>")
                    $("li",cartlist).remove()
                    r.orderItem = []
                    r.addItem = []
                    ssc.calculateCartlist()
                }
                else
                {
                    $.dialog.close('*');
                    layui.use('layer', function(layer){
                        layer.alert('<div style="text-align:center">'+info.info+'</div>',{'closeBtn':0,'time':3000,anim:3,btnAlign: 'c'})
                        $("li",cartlist).remove()
                        r.orderItem = []
                        r.addItem = []
                        ssc.calculateCartlist()
                    })
                    setTimeout(ssc.getBuyRecordItem,2000)
                    setTimeout(ssc.getBuyAddRecordItem,2000)
                    setTimeout(ssc.getMoney,2000)
                }
            },'json')
        }
    }
    win.ssc = ssc;
})(window);

$(function(){
    ssc.Loading()

    /* todo 选择奖金模式 */
    $(document).on('change',"select[name=prize]", function(){
        $n = r.selectItem[0]['playname']
        if($(this).val()==1)
        {
            ssc.setSelectItemLowPrize()
        }
        else
        {
            ssc.setSelectItemHeighPrize()
        }
    })

    /* todo 添加购买 */
    $(document).on("click",'a[data-method=addCartlist]',function(){
        ssc.addCartlist()
    })

    /*todo 删除购物车单条数据*/
    $(document).on('click', 'a[data-method="delete"]', function(e) {
        var $item = $(e.target).closest('li')
        var id = $(this).attr("data-field")
        $.dialog.close('*');
        layui.use('layer', function(layer){
        var index = layer.confirm('你确定要从购彩车中移除该订单吗?', {
            btn: ['确定','取消']
            ,anim:3
            ,btnAlign: 'c'
            }, function(){
                layer.close(index)
                $item.remove()
                r.orderItem.splice(id,1)
                ssc.calculateCartlist()
                $.dialog.close("*")
                return
            });
        })
    })

    /* todo 购物车全部清空 */
    $(document).on('click','a[data-method=cleanOrderItem]', function(){
        $.dialog.close('*');
        if($("li",cartlist).length==0) return false;
		layui.use('layer', function(layer){
        var index = layer.confirm('确定要清空购物车内容吗？', {
            btn: ['确定','取消']
            ,anim:3
            ,btnAlign: 'c'
            }, function(){
                layer.close(index)
                $("li",cartlist).remove()
                r.orderItem = []
                ssc.calculateCartlist()
                $.dialog.close("*")
                return
            });
        })
    })

    /* todo 倍数改变 */
    $('input[name=multiple]').on("blur",function(){
        $multipleval = parseInt($("input[name=multiple]").val())
        $multipleval = (isNaN($multipleval) || $multipleval==0) ? 1 : $multipleval;
        $("input[name=multiple]").val($multipleval)
        ssc.mutiplechange()
    })
    $("#diff").bind("click",function(){
        var multiple = parseInt($("input[name=multiple]").val())
        multiple = multiple + 1;
        $("input[name=multiple]").val(multiple)
        ssc.mutiplechange()
    })
    $("#plus").bind("click",function(){
        var multiple = parseInt($("input[name=multiple]").val())
        multiple = multiple - 1;
        multiple = (multiple<=0)?1:multiple;
        $("input[name=multiple]").val(multiple)
        ssc.mutiplechange()
    })

    /* todo 快速投注 */
    $('a[data-method="quickBet"]').on("click",function(){
        if(ssc.checkSubmit())
        {
            // 数据组合
            var t = new Date().getTime();
            var randkey = t + r.selectItem[0].lid + ssc.RndNum(6);
            randkey = "n*" + randkey + "*" + r.currentid + "*" + $("input[name=uid]").val();
            $selectData = r.selectItem[0].playname+':'+r.selectItem[0].selectNumber+":"+ r.selectItem[0].singernote+":1:"+r.selectItem[0].singermoney+
                ":"+ r.selectItem[0].model+":"+ r.selectItem[0].prize+":"+ r.selectItem[0].multiple+":"+ r.selectItem[0].position
            $data = "data="+$selectData+"&lottery_number_id="+r.currentid+"&is_add=0&lottery_id="+
                r.selectItem[0].lid+"&amount="+r.selectItem[0].singermoney+"&com="+randkey
            $('.quickBet').removeAttr('data-method')
            $('.quickBet').attr("disable","disable")
            $('.quickBet').html('<i class="icon-spinner icon-spin icon-1x"></i>提交中..')
            $.post("/Big",$data,function(info){
                $('.quickBet').removeAttr('disable')
                $('.quickBet').attr("data-method","quickBet")
                $('.quickBet').html('一键投注')
                 if(info==null) return
                if (info.status == 0 || info.status == "")
                {
                    $.dialog.close('*');
					layui.use('layer', function(layer){
                        layer.alert('<div style="text-align:center">'+info.info+'</div>',{closeBtn: 0, time: 3000,anim:3,btnAlign: 'c'});
                        ssc.cleanSelectItemData()
                        ssc.addCartlistAfterHandler()
                        $('#cartlist>li').remove()
                        r.orderItem = []
                        ssc.calculateCartlist()
                    })
                }
                else
                {
                    $.dialog.close('*');
					layui.use('layer', function(layer){
                        layer.alert('<div style="text-align:center">'+info.info+'</div>',{closeBtn: 0, time: 3000,anim:3,btnAlign: 'c'});
                        ssc.cleanSelectItemData()
                        ssc.addCartlistAfterHandler()
                        $('#cartlist>li').remove()
                        r.orderItem = []
                        ssc.calculateCartlist()
                        setTimeout(ssc.getBuyRecordItem,2000)
                        setTimeout(ssc.getBuyAddRecordItem,2000)
                        setTimeout(ssc.getMoney,2000)
                    })
                }
            },'json')
        }
        else
        {
            return false;
        }
    })

    /* todo 订单投注 */
    $('a[data-method=orderSubmit]').on("click",function(){
        $order = r.orderItem;
        var t = new Date().getTime();
        if($order.length==0) return false;
        var randkey = t + r.orderItem[0].lid + ssc.RndNum(6);
        randkey = "n*" + randkey + "*" + r.currentid + "*" + $("input[name=uid]").val();
        $selectData = ""
        $totalAmount = 0;
        for(var o in $order)
        {
            if($order[o].playname=="" || $order[o].selectNumber=="" || $order[o].singernote==0
                || $order[o].singermoney==0 || $order[o].model=="" || $order[o].prize=="" || parseInt($order[o].multiple)<1
                || r.currentid=="" || $order[o].lid=="" || $order[o].singermoney==0)
            {

            }
            else
            {
                $selectData += $order[o].playname+':'+$order[o].selectNumber+":"+ $order[o].singernote+":1:"+$order[o].singermoney+
                    ":"+ $order[o].model+":"+ $order[o].prize+":"+ $order[o].multiple + ":"+ $order[o].position + "||"
                $lid = $order[o].lid
                $totalAmount += parseFloat($order[o].singermoney*1000)
            }
        }
        if($selectData=="") return
        $selectData = $selectData.substr(0,$selectData.length-2);
        $totalAmount = parseFloat($totalAmount/1000)
        $data = "data="+$selectData+"&lottery_number_id="+r.currentid+"&is_add=0&lottery_id="+
            $lid+"&amount="+parseFloat($totalAmount)+"&com="+randkey
        $('.orderSubmit').removeAttr('data-method')
        $('.orderSubmit').attr("disable","disable")
        $('.orderSubmit').html('<i class="icon-spinner icon-spin icon-1x"></i>提交中..')
        $.post("/Big",$data,function(info){
            $('.orderSubmit').removeAttr('disable')
            $('.orderSubmit').attr("data-method","orderSubmit")
            $('.orderSubmit').html('立即投注')
            if (info.status == 0 || info.status == "")
            {
            	$.dialog.close('*');
				layui.use('layer', function(layer){
                    layui.use('layer', function(layer){
                        layer.alert('<div style="text-align:center">'+info.info+'</div>',{closeBtn: 0, time: 3000,anim:3,btnAlign: 'c'});
                        $('#cartlist>li').remove()
	                    r.orderItem = []
	                    ssc.calculateCartlist()
                    })
                })
            }
            else
            {
                $.dialog.close('*');
                layui.use('layer', function(layer){
                    layer.alert('<div style="text-align:center">'+info.info+'</div>',{closeBtn: 0, time: 3000,anim:3,btnAlign: 'c'});
                    $('#cartlist>li').remove()
                    r.orderItem = []
                    ssc.calculateCartlist()
                    setTimeout(ssc.getBuyRecordItem,2000)
                    setTimeout(ssc.getBuyAddRecordItem,2000)
                    setTimeout(ssc.getMoney,2000)
                })
            }
        },'json')
    })
})